# EIGRP Evaluation

### 네트워크 구성도

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/94185ce4-ccf9-40bc-b23d-310a7c9c96cb/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/94185ce4-ccf9-40bc-b23d-310a7c9c96cb/Untitled.png)

### **장치 연결**

1) 위 네트워크 구성도를 참조하여 GNS3를 사용하여 적절히 라우터 및 VPCS를 연결하고 디스플레이 이름을 변경하시오.

2) 장치 연결에 필요한 인터페이스는 네트워크 구성도에 명시된 인터페이스로 하시오.

(각 라우터 Slot 1에 추가할 모듈은 NM-4T)

3) Frame-Relay의 DLCI Mapping은 다음 표를 참조하여 설정하시오.

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/fd565dd3-5b31-40b4-99b8-c019b68f6318/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/fd565dd3-5b31-40b4-99b8-c019b68f6318/Untitled.png)

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/5d24fcc7-63ab-4fd0-97e3-e2df338218a6/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/5d24fcc7-63ab-4fd0-97e3-e2df338218a6/Untitled.png)

### **라우터 기본 설정(모든 라우터 공통)**

[콘솔모드]

1) 라우터 구성작업 도중에 시스템 정보와 관리자 명령이 서로 뒤섞이지 않게 설정하시오.

2) 명령어 입력이 없을 때(IDLE) 로그아웃 되지 않도록 설정하시오.

3) 콘솔 접속 시 패스워드를 ‘admin’으로 설정하고 적용하시오.

```
enable
configure terminal
line console 0
logging sync
exec-timeout 0
password admin
login
exit
```

[전체 설정모드]

4) 명령어를 잘못 입력 할 경우 DNS 질의를 하지 않도록 설정하시오.

5) 관리자 모드로 진입 시 패스워드를 ‘cisco’로 설정하되 MD5로 암호화 하시오.

6) 평문으로 된 패스워드를 암호화 시키시오.

7) 호스트이름을 네트워크 구성도를 참조하여 디스플레이 이름과 일치시키시오.

```
no ip domain-lookup
enable secret cisco
service password-encryption
hostname R
```

### **Frame-Relay 설정 및 IP주소 설정**

1) 네트워크 구성도를 참조하여 Frame-Relay와 연결된 Serial 인터페이스 설정 및 서브인터페이스를 생성하시오.

2) 모든 인터페이스에 IP주소를 할당하시오.

3) 서브인터페이스 속성에 따라 DLCI 번호와 매핑하시오.

4) 인접장치 간 Ping 테스트로 통신상태를 확인하시오.

```
R1(config)#int f0/0 
R1(config-if)#ip add 172.16.1.254 255.255.255.0 
R1(config-if)#no sh 
R1(config-if)#int f0/1 
R1(config-if)#ip add 172.16.12.1 255.255.255.0 
R1(config-if)#no sh 
R1(config-if)#int s1/0 
R1(config-if)#encapsulation frame-relay 
R1(config-if)#no sh 
R1(config-if)#int s1/0.134 multipoint 
R1(config-subif)#ip add 10.0.134.1 255.255.255.0 
R1(config-subif)#frame-relay map ip 10.0.134.3 103 broadcast 
R1(config-subif)#frame-relay map ip 10.0.134.4 104 broadcast 

R2(config)#int f0/0 
R2(config-if)#ip add 172.16.2.254 255.255.255.0 
R2(config-if)#no sh 
R2(config-if)#int f0/1 
R2(config-if)#ip add 172.16.12.2 255.255.255.0 
R2(config-if)#no sh 
R2(config-if)#int s1/0 
R2(config-if)#en f 
R2(config-if)#no sh 
R2(config-if)#int s1/0.24 point-to-point 
R2(config-subif)#ip add 10.0.24.2 255.255.255.0 
R2(config-subif)#frame-relay interface-dlci 204 

R3(config)#int f0/0
R3(config-if)#ip add 172.16.3.254 255.255.255.0 
R3(config-if)#no sh 
R3(config-if)#int s1/0 
R3(config-if)#en f 
R3(config-if)#no sh 
R3(config-if)#ip add 10.0.134.3 255.255.255.0 
R3(config-if)#frame-relay map ip 10.0.134.1 301 b 
R3(config-if)#frame-relay map ip 10.0.134.4 301 b 

R4(config)#int f0/0 
R4(config-if)#ip add 172.16.4.254 255.255.255.0 
R4(config-if)#no sh 
R4(config-if)#int s1/0 
R4(config-if)#en f 
R4(config-if)#no sh 
R4(config-if)#int s1/0.134 m 
R4(config-subif)#ip add 10.0.134.4 255.255.255.0 
R4(config-subif)#frame-relay map ip 10.0.134.1 401 b 
R4(config-subif)#frame-relay map ip 10.0.134.3 401 b 
R4(config-subif)#int s1/0.24 p 
R4(config-subif)#ip add 10.0.24.4 255.255.255.0 
R4(config-subif)#frame-relay interface-dlci 402 

PC-1> ip 172.16.1.1 24 172.16.1.254 
PC-2> ip 172.16.2.1 24 172.16.2.254
PC-3> ip 172.16.3.1 24 172.16.3.254 
PC-4> ip 172.16.4.1 24 172.16.4.254
```

### **EIGRP 설정**

1) 모든 라우터에 EIGRP(AS 100)를 설정하시오.

(단, 모든 라우터는 인터페이스 광고방식을 사용하여 광고되어야 함.)

2) 각 라우터의 라우팅 테이블을 확인하여 문제점을 찾아 보시오..

3) 원격지 컴퓨터 간의 Ping 테스트로 통신상태를 확인하시오.

```
R1(config)#router eigrp 100 
R1(config-router)#eigrp router-id 1.1.1.1 
R1(config-router)#network 172.16.1.254 0.0.0.0 
R1(config-router)#network 172.16.12.1 0.0.0.0 
R1(config-router)#network 10.0.134.1 0.0.0.0 

R2(config)#router eigrp 100 
R2(config-router)#eigrp router-id 2.2.2.2 
R2(config-router)#network 172.16.2.254 0.0.0.0 
R2(config-router)#network 172.16.12.2 0.0.0.0 
R2(config-router)#network 10.0.24.2 0.0.0.0 

R3(config)#router eigrp 100 
R3(config-router)#eigrp router-id 3.3.3.3 
R3(config-router)#network 172.16.3.254 0.0.0.0 
R3(config-router)#network 10.0.134.3 0.0.0.0 

R4(config)#router eigrp 100 
R4(config-router)#eigrp router-id 4.4.4.4 
R4(config-router)#network 172.16.4.254 0.0.0.0 
R4(config-router)#network 10.0.134.4 0.0.0.0 
R4(config-router)#network 10.0.24.4 0.0.0.0
```

### **문제해결 및 기타설정**

1) 각 라우터의 Serial 인터페이스 상태를 확인하여 EIGRP Split-horizon으로 인한 문제를 해결하시오.

2) 모든 라우터의 자동축약 기능을 중지하시오.

3) 광고가 불필요한 인터페이스로는 라우팅 정보가 광고되지 않도록 차단하시오.

4) R2-R4 구간에 인증(Authentication)을 설정하되 암호는 cisco로 하시오.

5) R2의 기본경로가 R1이 되도록 설정하시오.

6) R1의 라우팅 테이블에 172.16.4.0/24에 대해 비균등 부하분산이 되도록 설정하시오.

```
1)
R1(config)#int s1/0.134 
R1(config-subif)#no ip split-horizon eigrp 100

2)
R1(config)#router eigrp 100 
R1(config-router)#no auto-summary 

R2(config)#router eigrp 100 
R2(config-router)#no auto-summary

R3(config)#router eigrp 100 
R3(config-router)#no auto-summary 

R4(config)#router eigrp 100 
R4(config-router)#no auto-summary

sh ip route 로 확인
3)
R1(config-router)#passive-interface f0/0 

R2(config-router)#passive-interface f0/0 

R3(config-router)#passive-interface default 
R3(config-router)#no passive-interface s1/0  

R4(config-router)#passive-interface f0/0

4)
R2(config)#key chain R2-KEY 
R2(config-keychain)#key 1 
R2(config-keychain-key)#key-string cisco 
R2(config-keychain-key)#int s1/0.24 
R2(config-subif)#ip authentication key-chain eigrp 100 R2-KEY 
R2(config-subif)#ip authentication mode eigrp 100 md5

R4(config)#key chain R4-KEY 
R4(config-keychain)#key 1 
R4(config-keychain-key)#key-string cisco 
R4(config-keychain-key)#int s1/0.24 
R4(config-subif)#ip authentication key-chain eigrp 100 R4-KEY 
R4(config-subif)#ip authentication mode eigrp 100 md5

sh ip eigrp neighbor로 확인

5)
- 방법 1 
R2(config)#ip route 0.0.0.0 0.0.0.0 f0/1 172.16.12.1 

- 방법 2 
R1(config)#ip route 0.0.0.0 0.0.0.0 null0 
R1(config)#router eigrp 100 
R1(config-router)#redistribute static

6)
R1(config)#router eigrp 100 
R1(config-router)#variance 2 

R2(config)#int s1/0.24 
R2(config-subif)#bandwidth 1545
```

# OSPF Evaluation

### 장치 연결

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/03127654-bf39-465d-9a3f-6062f1767f24/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/03127654-bf39-465d-9a3f-6062f1767f24/Untitled.png)

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/db497cd6-37f5-4fe0-859e-a8d5777ad4b1/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/db497cd6-37f5-4fe0-859e-a8d5777ad4b1/Untitled.png)

### 기본설정

```
enable 
configure terminal 
line console 0 
logging synchronous 
exec-timeout 0 
password console 
login 
exit 
line vty 0 4 
password telnet 
login 
exit 
no ip domain-lookup 
enable secret cisco 
hostname
```

### IP 주소 설정(F/R 설정)

```
R1(config)#int f0/0 
R1(config-if)#ip add 172.16.1.254 255.255.255.0 
R1(config-if)#no sh 
R1(config-if)#int f0/1 
R1(config-if)#ip add 172.16.12.1 255.255.255.0 
R1(config-if)#no sh 
R1(config-if)#int s1/0 
R1(config-if)#en f 
R1(config-if)#no sh 
R1(config-if)#int s1/0.134 m 
R1(config-subif)#ip add 172.16.134.1 255.255.255.0 
R1(config-subif)#frame map ip 172.16.134.3 103 b 
R1(config-subif)#frame map ip 172.16.134.4 104 b 
R1(config-subif)#int s1/0.15 p 
R1(config-subif)#ip add 10.0.15.1 255.255.255.0 
R1(config-subif)#frame interface-dlci 105

R2(config)#int f0/0 
R2(config-if)#ip add 172.16.2.254 255.255.255.0 
R2(config-if)#no sh 
R2(config-if)#int f0/1 
R2(config-if)#ip add 172.16.12.2 255.255.255.0 
R2(config-if)#no sh

R3(config)#int f0/0 
R3(config-if)#ip add 172.16.3.254 255.255.255.0 
R3(config-if)#no sh 
R3(config-if)#int s1/0 
R3(config-if)#en f 
R3(config-if)#no sh 
R3(config-if)#int s1/0.134 m 
R3(config-subif)#ip add 172.16.134.3 255.255.255.0 
R3(config-subif)#frame map ip 172.16.134.1 301 b 
R3(config-subif)#frame map ip 172.16.134.4 301 b

R4(config)#int f0/0 
R4(config-if)#ip add 172.16.4.254 255.255.255.0 
R4(config-if)#no sh 
R4(config-if)#int s1/0 
R4(config-if)#en f 
R4(config-if)#no sh 
R4(config-if)#int s1/0.134 m 
R4(config-subif)#ip add 172.16.134.4 255.255.255.0 
R4(config-subif)#frame map ip 172.16.134.1 401 b 
R4(config-subif)#frame map ip 172.16.134.3 401 b

R5(config)#int f0/0 
R5(config-if)#ip add 10.0.5.254 255.255.255.0 
R5(config-if)#no sh 
R5(config-if)#int s1/0 
R5(config-if)#en f 
R5(config-if)#no sh 
R5(config-if)#int s1/0.15 p 
R5(config-subif)#ip add 10.0.15.5 255.255.255.0 
R5(config-subif)#frame int 501
```

### 라우터 DHCP 설정

```
R2(config)#ip dhcp pool DHCP 
R2(dhcp-config)#network 172.16.2.0 255.255.255.0 
R2(dhcp-config)#default-router 172.16.2.254 
R2(dhcp-config)#dns-server 8.8.8.8 
R2(dhcp-config)#exit 
R2(config)#ip dhcp excluded-address 172.16.2.2 172.16.2.255

R3(config)#ip dhcp pool DHCP 
R3(dhcp-config)#network 172.16.3.0 255.255.255.0 
R3(dhcp-config)#default-router 172.16.3.254 
R3(dhcp-config)#dns-server 8.8.8.8 
R3(dhcp-config)#exit 
R3(config)#ip dhcp excluded-address 172.16.3.2 172.16.3.255

R4(config)#ip dhcp pool DHCP 
R4(dhcp-config)#network 172.16.4.0 255.255.255.0 
R4(dhcp-config)#default-router 172.16.4.254 
R4(dhcp-config)#dns-server 8.8.8.8 
R4(dhcp-config)#exit 
R4(config)#ip dhcp ex 172.16.4.2 172.16.4.255

R5(config)#ip dhcp pool DHCP 
R5(dhcp-config)#network 10.0.5.0 255.255.255.0 
R5(dhcp-config)#default-router 10.0.5.254  
R5(dhcp-config)#dns-server 8.8.8.8 
R5(dhcp-config)#exit 
R5(config)#ip dhcp ex 10.0.5.2 10.0.5.255
```

### 라우팅 (OSPF, RIPv2) 설정

```
[OSPF] 
R1(config)#router ospf 1 
R1(config-router)#router-id 1.1.1.1 
R1(config-router)#network 172.16.1.254 0.0.0.0 a 0 
R1(config-router)#network 172.16.12.1 0.0.0.0 a 1 
R1(config-router)#network 172.16.134.1 0.0.0.0 a 0

R2(config)#router ospf 2 
R2(config-router)#router-id 2.2.2.2 
R2(config-router)#network 172.16.2.254 0.0.0.0 a 1 
R2(config-router)#network 172.16.12.2 0.0.0.0 a 1

R3(config)#router ospf 3 
R3(config-router)#router-id 3.3.3.3 
R3(config-router)#network 172.16.3.254 0.0.0.0 a 3 
R3(config-router)#network 172.16.134.3 0.0.0.0 a 0

R4(config)#router ospf 4 
R4(config-router)#router-id 4.4.4.4 
R4(config-router)#network 172.16.4.254 0.0.0.0 a 4 
R4(config-router)#network 172.16.134.4 0.0.0.0 a 0

R1(config)#router ospf 1 
R1(config-router)#neighbor 172.16.134.3 
R1(config-router)#neighbor 172.16.134.4

[RIPv2] 
R1(config)#router rip 
R1(config-router)#ver 2 
R1(config-router)#network 10.0.0.0

R5(config)#router rip 
R5(config-router)#ver 2 
R5(config-router)#network 10.0.0.0
```

### DR 선출

```
R1(config)#int s1/0.134 
R1(config-subif)#ip ospf priority 255

R3(config)#int s1/0.134 
R3(config-subif)#ip ospf priority 0

R4(config)#int s1/0.134 
R4(config-subif)#ip ospf priority 0

- Router Priority 값 변경 후 R1, R3, R4 OSPF 프로세스 초기화 
R1#clear ip ospf process  
Reset ALL OSPF processes? [no]: y
```

### 재분배

```
R1(config)#router ospf 1
R1(config-router)#redistribute rip subnets

R1(config)#router rip 
R1(config-router)#redistribute ospf 1 metric 15
```

# ACL(Access Control List)

### ACL의 개요

1. ACL은 가장 기본적이고 중요한 라우터 IOS 방화벽이다.
2. 특정한 패킷을 차단 또는 허용할 때 사용한다.
3. Standard ACL, Extended ACL, Reflexive ACL, Dynamic ACL, Context-based ACL, ZFW 순으로 발전되어 왔다.
4. 허용/차단을 결정하는 참조요소에 따라 Standard ACL, Extended ACL로 구분하고, 번호를 사용하느냐 이름을 사용하느냐에 따라 Numbered ACL, Named ACL로 구분한다.
    1. Standard ACL: 출발지 IP 주소만 참조한다.
    2. Extended ACL: 출발지 IP 주소, 목적지 IP 주소, 프로토콜, 포트번호, 옵션 등을 참조한다.
    3. Numbered ACL: 작성된 리스트에 새로운 문장을 추가 삭제할 수 없다.
    4. Named ACL: 작성된 리스트에 새로운 문장을 추가 삭제할 수 있다. (권장)

### ACL 설정 시 주의사항

1. ACL은 리스트의 첫 줄부터 순차적으로 바로 적용되므로 가장 좁은 범위부터 선언한다.
2. 빈번히 발생하는 트래픽을 먼저 선언한다.
3. 리스트의 마지막 줄에 항상 보이지 않는 ‘deny any’ 또는 ‘deny ip any any’가 있음을 인지하고 설정한다.
4. 적용할 인터페이스의 위치 및 방향(In, Out)을 미리 정해 놓고 설정한다.
5. Numbered ACL은 리스트 중간에 새로운 문장을 추가 삭제할 수 없으며 항상 마지막 줄에 더해 진다는 것을 인지하고 설정한다.

### ACL 설정과 적용

1. 번호를 사용한 Standard ACL 설정

    ```
    R1(config)# access-list [Number] [deny/permit] [Source IP]
    ```

2. 번호를 사용한 Extended ACL 설정

    ```
    R1(config)# access-list [Number] [deny/permit] [protocol] [Source IP] [W/M] [Destination IP] [W/M] [Option] [Port Number]
    ```

3. 번호를 사용한 ACL 적용

    ```
    R1(config-if)# ip access-group [Number] [in/out]
    ```

4. 이름을 사용한 Standard ACL 설정

    ```
    R1(config)# ip access-list standard [WORD]
    R1(config-std-nad)# [deny/permit] [Source IP]
    ```

5. 이름을 사용한 Extended ACL 설정

    ```
    R1(config)# ip access-list extended [WORD]
    R1(config-std-nad)# [deny/permit] [protocol] [Source IP] [W/M] [Destination IP] [W/M] [Option] [Port Number]
    ```

6. 이름을 사용한 ACL 적용

    ```
    R1(config-if)# ip access-group [WORD] [in/out]
    ```
