### R1ê³¼ R2ê°„ì˜ RIP ì¸ì¦ ì‹¤ìŠµ

```
R1(config)#key chain R1-R2   
R1(config-keychain)#key 1                    < í‚¤ì˜ ì•„ì´ë””ëŠ” ë°˜ë“œì‹œ R2ì™€ ê°™ì•„ì•¼í•œë‹¤
R1(config-keychain-key)#key-string kim       < ì´ ë¹„ë°€ë²ˆí˜¸ëŠ” R2ì˜ í‚¤ì˜ ë¹„ë°€ë²ˆí˜¸ì™€ ê°™ì•„ì•¼í•¨
R1(config-keychain-key)#exit
R1(config-keychain)#exit
R1(config)#int f0/1
R1(config-if)#ip rip authentication key-chain R1-R2
```

```
R2(config)#key chain R2-R1
R2(config-keychain)#key 1
R2(config-keychain-key)#key-string kim
R2(config-keychain-key)#exit
R2(config-keychain)#exit
R2(config)#int f0/1
R2(config-if)#ip rip authentication key-chain R2-R1
```

### ì¸ì¦ í™•ì¸í•˜ëŠ” ë°©ë²•ë“¤

1. do sh run

    ```
    R2(config-if)#do sh run
    interface FastEthernet0/1
     ip address 192.168.12.2 255.255.255.0
     ip rip authentication key-chain R2-R1 < ì ìš©ëœê±° í™•ì¸
     duplex auto
     speed auto
    ```

2. show key chain

    ```
    R2#show key chain
    Key-chain R2-KEY:
        key 1 -- text "test"
            accept lifetime (always valid) - (always valid) [valid now]
            send lifetime (always valid) - (always valid) [valid now]
    Key-chain R2-R1:
        key 1 -- text "kim"
            accept lifetime (always valid) - (always valid) [valid now]
            send lifetime (always valid) - (always valid) [valid now]
    ```

3. show key chain [key name]

    ```
    R2#show key chain R2-R1
    Key-chain R2-R1:
        key 1 -- text "kim"
            accept lifetime (always valid) - (always valid) [valid now]
            send lifetime (always valid) - (always valid) [valid now]
    ```

4. show run int f0/1

    ```
    R2#show run int f0/1
    Building configuration...

    Current configuration : 136 bytes
    !
    interface FastEthernet0/1
     ip address 192.168.12.2 255.255.255.0
     ip rip authentication key-chain R2-R1
     duplex auto
     speed auto
    end
    ```

í‰ë¬¸ì´ë¼ ë¹„ë°€ë²ˆí˜¸ê°€ ì•”í˜¸í™” ë˜ì§€ ì•ŠëŠ”ë‹¤

ì´ê²ƒì„ ì•”í˜¸í™” ì‹œí‚¬ ìˆ˜ ìˆëŠ” ëª¨ë“œ = md5

### RIPì—ì„œì˜ ì¸ì¦ë°©ì‹

1. í‰ë¬¸

    í˜„ì¬ í•œ ê²ƒë“¤

2. MD5

    ```
    R1(config-if)#ip rip authentication mode ?         
      md5   Keyed message digest
      text  Clear text authentication

    R1(config-if)#ip rip authentication mode md5

    R2(config)#int f0/1
    R2(config-if)#ip rip authentication mode md5
    ```

ğŸ’¡ ë°˜ë“œì‹œ ë‘ ë¼ìš°í„° ê°„ì˜ ëª¨ë“œëŠ” ì¼ì¹˜í•´ì•¼ í•œë‹¤

onenoteì— RIP>RIP ì‹¤ìŠµ ë³´ê³  ë”°ë¼ ì§„í–‰í•œë‹¤

GNS3 ìƒˆ í”„ë¡œì íŠ¸(í”„ë¡œê·¸ë¨ ì™„ì „íˆ ê»ë‹¤ í‚¤ëŠ” ê²ƒì´ ì˜¤ë¥˜ê°€ ì—†ìŒ) > í”„ë¡œì íŠ¸ ëª… : 20210205-RIP

# RIP ì‹¤ìŠµ

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/373e86cf-87b3-4bb0-b5c7-25e20224e2f8/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/373e86cf-87b3-4bb0-b5c7-25e20224e2f8/Untitled.png)

R3ì˜ F1/0 ipì£¼ì†Œ ì˜¤íƒ€ .4 â†’ .3

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/1ebee621-8c64-42e9-b0b0-157cbca20ac8/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/1ebee621-8c64-42e9-b0b0-157cbca20ac8/Untitled.png)

Router: C3660, PC: VPCS, Switch: Ethernet switch

R1,R3,R4 > configure > slot 1 : NM-1FE-TX

ğŸ’¡ì„¤ê³„ ì‹œ ì£¼ì˜ì‚¬í•­

1. ë¹„ìš©. ì“¸ëª¨ì—†ëŠ” slotí™•ì¥ í•˜ì§€ ë§ˆë¼. ê¼­ í•„ìš”í•œ ê²ƒë§Œ í™•ì¥
2. í™•ì¥ì„±
3. ë³´ì•ˆ ë“±ë“±

Start all

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/c56da4d1-98a0-4239-adc4-76e1f06536e9/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/c56da4d1-98a0-4239-adc4-76e1f06536e9/Untitled.png)

### ë¼ìš°í„° 4ëŒ€ ê¸°ë³¸ ì„¤ì •

```
enable
configure terminal
line console 0
logging synchronous
exec-timeout 0
password console
login
exit
line vty 0 4
password telnet
login
exit
no ip domain-lookup
enable secret cisco
hostname R
```

### ë¼ìš°í„° ip ì„¤ì •

```
R1(config)#int f0/0
R1(config-if)#ip add 172.16.1.254 255.255.255.0
R1(config-if)#no sh                              
R1(config-if)#int f0/1
R1(config-if)#ip add 172.16.123.1 255.255.255.0
R1(config-if)#no sh
R1(config-if)#int f1/0
R1(config-if)#ip add 172.16.14.1 255.255.255.0
R1(config-if)#no sh

R2(config)#int f0/0  
R2(config-if)#ip add 172.16.2.254 255.255.255.0
R2(config-if)#no sh
R2(config-if)#int f0/1
R2(config-if)#ip add 172.16.123.2 255.255.255.0
R2(config-if)#no sh

R3(config)#int f0/0
R3(config-if)#ip add 172.16.3.254 255.255.255.0
R3(config-if)#no sh
R3(config-if)#int f0/1
R3(config-if)#ip add 172.16.123.3 255.255.255.0
R3(config-if)#no sh
R3(config-if)#int f1/0
R3(config-if)#ip add 172.16.34.3 255.255.255.0
R3(config-if)#no sh

R4(config)#int f0/0
R4(config-if)#ip add 172.16.4.254 255.255.255.0
R4(config-if)#no sh
R4(config-if)#int f0/1
R4(config-if)#ip add 172.16.34.4 255.255.255.0
R4(config-if)#no sh
R4(config-if)#int f1/0
R4(config-if)#ip add 172.16.14.4 255.255.255.0
R4(config-if)#no sh
```

### ì»´í“¨í„° ip ì„¤ì •

```
A> ip 172.16.1.1 172.16.1.254 24
Checking for duplicate address...
PC1 : 172.16.1.1 255.255.255.0 gateway 172.16.1.254
A> save
Saving startup configuration to startup.vpc
.  done

B> ip 172.16.2.1 172.16.2.254 24
Checking for duplicate address...
PC1 : 172.16.2.1 255.255.255.0 gateway 172.16.2.254
B> save
Saving startup configuration to startup.vpc
.  done

C> ip 172.16.3.1 172.16.3.254 24
Checking for duplicate address...
PC1 : 172.16.3.1 255.255.255.0 gateway 172.16.3.254
C> save
Saving startup configuration to startup.vpc
.  done

D> ip 172.16.4.1 172.16.4.254 24
Checking for duplicate address...
PC1 : 172.16.4.1 255.255.255.0 gateway 172.16.4.254
D> save
Saving startup configuration to startup.vpc
.  done
```

### ì—°ê²° í™•ì¸

```
R1#ping 172.16.1.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.16.1.1, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 8/16/20 ms
R1#ping 172.16.123.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.16.123.2, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 24/33/40 ms
R1#ping 172.16.123.3

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.16.123.3, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 24/35/52 ms
R1#ping 172.16.14.4 

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 172.16.14.4, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 16/31/48 ms
```

- ğŸ’¡ ë§Œì•½ í•‘ì´ ì œëŒ€ë¡œ ê°€ì§€ ì•ŠëŠ”ë‹¤ë©´ í™•ì¸í•˜ëŠ” ë°©ë²•

    ```
    R1#sh ip int brief
    Interface                  IP-Address      OK? Method Status                Protocol
    FastEthernet0/0            172.16.1.254    YES manual up                    up      
    FastEthernet0/1            172.16.123.1    YES manual up                    up      
    FastEthernet1/0            172.16.14.1     YES manual up                    up
    ```

    ![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/5397d811-4388-4cde-a5a9-675b926ae8e0/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/5397d811-4388-4cde-a5a9-675b926ae8e0/Untitled.png)

íšŒì‚¬ê°€ ì›í•˜ëŠ” ì¸ì¬

1. ì°½ì˜ì„±
2. ìƒì‚°ì„±
3. ê±´ê°•

### ë¼ìš°íŒ… ì„¤ì •

```
R1(config)#router rip
R1(config-router)#ver 2    
R1(config-router)#network 172.16.0.0

R2,R3,R4 ëª¨ë‘ ë™ì¼
```

ë¼ìš°íŒ… í…Œì´ë¸” í™•ì¸

```
R1(config-router)#do sh ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

     172.16.0.0/24 is subnetted, 7 subnets
R       172.16.34.0 [120/1] via 172.16.123.3, 00:00:18, FastEthernet0/1
                    [120/1] via 172.16.14.4, 00:00:19, FastEthernet1/0
C       172.16.14.0 is directly connected, FastEthernet1/0
R       172.16.4.0 [120/1] via 172.16.14.4, 00:00:19, FastEthernet1/0
C       172.16.1.0 is directly connected, FastEthernet0/0
R       172.16.2.0 [120/1] via 172.16.123.2, 00:00:14, FastEthernet0/1
R       172.16.3.0 [120/1] via 172.16.123.3, 00:00:18, FastEthernet0/1
C       172.16.123.0 is directly connected, FastEthernet0/1
```

ì›ê²©ì¥ì¹˜ í†µì‹  í™•ì¸

```
A> ping 172.16.2.1
A> ping 172.16.3.1
A> ping 172.16.4.1
```

# RIP Evaluation

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/b44e4bbf-f426-4707-b1a7-e190473eac48/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/b44e4bbf-f426-4707-b1a7-e190473eac48/Untitled.png)

### ì‘ì—…Â ìˆœì„œ

1. CISCO Packet Tracerë¥¼ ì‚¬ìš©í•˜ì—¬ ìœ„ êµ¬ì„±ë„ì™€ ê°™ì´ ê° ì¥ì¹˜ë¥¼ ì—°ê²°
2. ì‚¬ìš©í• Â ì¥ì¹˜:Â ë¼ìš°í„°(2620XM, NM-2FE2W),Â ìŠ¤ìœ„ì¹˜(2960), PC
3. ê° ë¼ìš°í„° ê¸°ë³¸ì„¤ì •

    ```
    enable
    configure terminal
    line console 0
    logging synchronous
    exec-timeout 0
    password console
    login
    exit
    line vty 0 4
    password telnet
    login
    exit
    no ip domain-lookup
    enable secret cisco
    hostname R
    ```

4. ê° ì¥ì¹˜Â IPÂ ì£¼ì†Œ ì„¤ì •Â (IPÂ ì£¼ì†Œ ì„¤ì • í›„ ì¸ì ‘ ì¥ì¹˜ ê°„Â PingÂ í…ŒìŠ¤íŠ¸ í™•ì¸)

    â†’ R(config-if)#int f0/0

    â†’ R(config-if)#ip add ~~~~

    â†’ R(config-if)#no sh

5. ëª¨ë“  ë¼ìš°í„°ì—Â RIP ver2ë¥¼ ì„¤ì •Â (ì„¤ì • í›„ ì›ê²©ì§€Â PCÂ ê°„Â PingÂ í…ŒìŠ¤íŠ¸ í™•ì¸)

    â†’ R(config-router)# ver2

6. ê¸°íƒ€ í•„ìš”í•œ ì„¤ì •
    1. RIPÂ ê´‘ê³ ê°€ ë¶ˆí•„ìš”í•œ ì¸í„°í˜ì´ìŠ¤ë¡œëŠ” ë¼ìš°íŒ… ì •ë³´ê°€ ê´‘ê³ ë˜ì§€ ì•Šë„ë¡ ì°¨ë‹¨í•˜ê¸°.

        â†’ R(config-router)#passive-interface f0/0

    2. Auto-SummaryÂ ì¤‘ì§€í•˜ê¸°.

        â†’ R(config-router)#no auto-summary

    3. ê¸°ë³¸ê²½ë¡œë¥¼Â R1ìœ¼ë¡œ ì„¤ì •í•˜ê¸°.

        â†’ R1(config-router)#default-information originate

### ì§ˆë¬¸ê³¼Â ë‹µë³€

1. RIPì˜ ê°œìš”ì™€ íŠ¹ì§•ì— ëŒ€í•´ ì„¤ëª…í•˜ì‹œì˜¤.

    â†’ RIPver1Â ê³¼Â RIPver2Â ê°€ ìˆë‹¤.

    â†’ ë¼ìš°íŒ… ì •ë³´ ì „ì†¡ì„ ìœ„í•˜ì—¬Â UDP Port Number 520ì„ ì‚¬ìš©í•œë‹¤.

    â†’ ì„¤ì •ì´Â ë¹„êµì Â ì‰½ë‹¤.

    â†’ ê±°ì˜ ëª¨ë“  ë¼ìš°í„°ì—ì„œ ì§€ì›í•˜ëŠ” í‘œì¤€Â Routing ProtocolÂ ì´ë‹¤.

    â†’ ê²½ë¡œÂ ê²°ì •Â ì‹œÂ Metricìœ¼ë¡œÂ Hop Countë¥¼ ì‚¬ìš©í•˜ê³  ë§í¬ì˜ ì†ë„ëŠ” ë°˜ì˜í•˜ì§€ ì•ŠëŠ”ë‹¤.

    â†’ Hop Countê°€Â 16ì´ìƒì´ë©´ ë„ë‹¬ ë¶ˆê°€ëŠ¥í•œ ë„¤íŠ¸ì›Œí¬ë¡œ ê°„ì£¼í•œë‹¤.

    â†’ ë¼ìš°íŒ… ì •ë³´ ì „ì†¡ ë°©ì‹ì´ ë¹„íš¨ìœ¨ì ì´ë‹¤.Â 30ì´ˆë§ˆë‹¤Â ì£¼ê¸°ì Â ì—…ë°ì´íŠ¸(Periodic Update)Â í•œë‹¤.Â ë‹¤ë¥¸Â ë™ì Â ë¼ìš°íŒ…Â í”„ë¡œí† ì½œë“¤ì€Â íŠ¸ë¦¬ê±°ë“œÂ ì—…ë°ì´íŠ¸(Triggered Update)Â í•œë‹¤.

    â†’ ì†Œê·œëª¨Â ë„¤íŠ¸ì›Œí¬ì—Â ì‚¬ìš©í•˜ê¸°Â ì í•©í•˜ë‹¤.

2. RIPì˜ ì„¤ì • ë°©ë²•ì— ëŒ€í•´ ì„¤ëª…í•˜ì‹œì˜¤.

    â†’ R1(config)#router rip //ë¼ìš°í„° ì„¤ì • ëª¨ë“œ ì§„ì…

    â†’ R1(config-router)#network [ê´‘ê³ í•  ì£¼ ë„¤íŠ¸ì›Œí¬]  //network ëª…ë ¹ì€ ë¼ìš°í„°ì˜ Interfaceì— ì„¤ì •ëœ ë„¤íŠ¸ì›Œí¬ë¥¼ ì¸ì ‘í•œ ë¼ìš°í„°ì—ê²Œ ê´‘ê³ í•˜ëŠ” ê¸°ëŠ¥ê³¼ íŠ¹ì • Interfaceë¡œ RIP ê´‘ê³ ë¥¼ ì „ì†¡í•˜ëŠ” ê¸°ëŠ¥ì´ë‹¤.

    â†’ R1(config-router)#version [1or2] //RIPver1, ver2 ì„¤ì •

3. RIP ver1Â ê³¼Â RIP ver2ì˜ ê³µí†µì ê³¼ ì°¨ì´ì ì„ ì„¤ëª…í•˜ì‹œì˜¤.

    â†’ ê³µí†µì  : distance vector (ê±°ë¦¬ì™€ ë°©í–¥ì„ ë³´ê³  íŒë‹¨), split horizon(í•´ë‹¹ íŠ¹ì • ì¸í„°í˜ì´ìŠ¤ë¡œ ë“¤ì–´ì˜¤ëŠ” ê´‘ê³  ë‚´ìš©ì„ ë‹¤ì‹œ í•´ë‹¹ ì¸í„°í˜ì´ìŠ¤ë¡œ ë˜‘ê°™ì€ ì •ë³´ë¥¼ ì•Œë¦¬ì§€ ì•ŠëŠ”ë‹¤. ë¶€í•˜ë¥¼ ì¤„ì´ê¸° ìœ„í•´) , auto summary(ìë™ ì¶•ì•½)

    â†’ ver1 : ì„œë¸Œë„· ë§ˆìŠ¤í¬ ì •ë³´ ì—†ìŒ, classful routing, vlsm ì§€ì› ì•ˆí•¨, Broadcast(255.255.255.255)

    â†’ ver2 : ì„œë¸Œë„· ë§ˆìŠ¤í¬ ì •ë³´ ìˆìŒ, classless routing, vlsm ì§€ì›, Multicast(224.0.0.9), Authentication ì§€ì›, Manually Summary ì§€ì›

4. RIPì˜Â Timerì˜ ì¢…ë¥˜ì™€ ì—­í• ì— ëŒ€í•´ ì„¤ëª…í•˜ì‹œì˜¤.

    â†’ Update Timer : 30s

    â†’ Invalid Timer : 180s, ë¼ìš°íŒ… ê´‘ê³ ë¥¼ ìˆ˜ì‹  ë°›ìœ¼ë©´ ë‹¤ì‹œ ì—…ë°ì´íŠ¸ ëœë‹¤.

    â†’ HoldDown Timer : 180s Routing Loop ë°©ì§€. ë¼ìš°íŒ… ê´‘ê³ ë¥¼ ìˆ˜ì‹  ë°›ì•„ë„ ë¬´ì‹œëœë‹¤.

    â†’ Flush Timer : 240s, ë§Œë£Œë˜ë©´ ë¼ìš°íŒ… í…Œì´ë¸”ì—ì„œ ì§€ì›Œì§„ë‹¤.

5. RIPÂ ì„¤ì •ì—ì„œ ê¸°ë³¸ê²½ë¡œ ì„¤ì •ë°©ë²•ì˜ ë‹¤ì–‘ì„±ì— ëŒ€í•´ ì„¤ëª…í•˜ì‹œì˜¤.

    â†’ R(config)#ip default-network [ì£¼ ë„¤íŠ¸ì›Œí¬]

    â†’ R(config)#default-information originate

6. ìë™ì¶•ì•½ê³¼ ìˆ˜ë™ì¶•ì•½ì— ëŒ€í•´ ì„¤ëª…í•˜ì‹œì˜¤.

    â†’ ìë™ ì¶•ì•½

    1. RIPì€ ì£¼ ë„¤íŠ¸ì›Œí¬ ê²½ê³„(Major Network Boundary)ì—ì„œ ìë™ì¶•ì•½(Auto-Summary)ì´ ì´ë£¨ì–´ì§„ë‹¤.
    2. ê´‘ê³ í•˜ëŠ” ë¼ìš°í„°ì˜Â Routing Tableê³¼ ì£¼ ë„¤íŠ¸ì›Œí¬ ê²½ê³„ì„ ì§€ë‚˜ëŠ” ë‹¤ë¥¸ ë¼ìš°í„°ì˜Â Routing Tableì„ í™•ì¸í•˜ì—¬ ì°¨ì´ì ì„ í™•ì¸í•œë‹¤.
    3. ë¹„ì—°ì† ë„¤íŠ¸ì›Œí¬(Discontiquous Network)ë¥¼ ë§Œë“¤ë©´Â Routing Tableì„ ì œëŒ€ë¡œ ë§Œë“¤ì§€ ëª»í•œë‹¤.
    4. RIP ver1ì—ì„œëŠ” ìë™ì¶•ì•½ ê¸°ëŠ¥ì´ ì¤‘ì§€ë˜ì§€Â ì•ŠëŠ”ë‹¤.
    5. RIP ver2ì—ì„œëŠ” ìë™ì¶•ì•½ ê¸°ëŠ¥ì„ ì¤‘ì§€ì‹œí‚¬ ìˆ˜ ìˆë‹¤.

    â†’ ìˆ˜ë™ ì¶•ì•½

    1. ì£¼ ë„¤íŠ¸ì›Œí¬ ë²”ìœ„ ë‚´ì—ì„œë§Œ ì¶•ì•½ì‹œí‚¬ ìˆ˜ ìˆë‹¤.
    2. ì„œë¡œ ë‹¤ë¥¸ ì£¼ ë„¤íŠ¸ì›Œí¬ë¥¼ í•˜ë‚˜ë¡œ ì¶•ì•½í•  ìˆ˜ ì—†ìœ¼ë©°,Â RIPÂ ì™¸ì˜Â ë¼ìš°íŒ…Â í”„ë¡œí† ì½œì€Â ì£¼ ë„¤íŠ¸ì›Œí¬ ë²”ìœ„ ë‚´ì—ì„œë§Œ ì¶•ì•½í•œë‹¤ëŠ” ì œì•½ ì‚¬í•­ì´ ì—†ë‹¤.
    3. ì¶•ì•½ë‚´ìš©ì„ ë³´ë‚´ê³ ì í•˜ëŠ”Â Interfaceì—ì„œÂ ip summary-address ripÂ ëª…ë ¹ì–´ë¥¼ ì‚¬ìš©í•œë‹¤.
7. RIPÂ ì‚¬ìš© ì‹œ ë³´ì•ˆ ëŒ€ì±…ì— ëŒ€í•´ ì„¤ëª…í•˜ì‹œì˜¤.

    â†’ ë‹¤ë¥¸Â ë¼ìš°íŒ…Â í”„ë¡œí† ì½œì€Â ë°˜ë“œì‹œÂ ë„¤ì´ë²„(Neighbor)Â ê´€ê³„ë¥¼ ë§ºì€ í›„ ì •ë³´ë¥¼ êµí™˜í•˜ì§€ë§Œ,Â RIPì€Â ë„¤ì´ë²„(Neighbor)Â ê´€ê³„ë¥¼ ë§ºì§€ ì•Šê³  ì „ì†¡ ê°€ëŠ¥í•œ ëª¨ë“ Â Interfaceë¡œ ë¼ìš°íŒ… ì •ë³´ë¥¼ ì†¡ì‹ í•œë‹¤.

    ë”°ë¼ì„œ, Passive-interfaceÂ ëª…ë ¹ì„ í†µí•´ ë¼ìš°íŒ… ì •ë³´ë¥¼ ì „ì†¡í•˜ì§€ ëª»í•˜ê²Œ ì ì ˆíˆÂ ì°¨ë‹¨í•  í•„ìš”ê°€Â ìˆë‹¤.

    í•˜ì§€ë§Œ,Â Passive-interfaceÂ ëª…ë ¹ì„ ì‚¬ìš©í•´ë„ ìƒëŒ€ì¸¡ì—ì„œ ì „ì†¡í•˜ëŠ” ë¼ìš°íŒ… ì •ë³´ë¥¼ ìˆ˜ì‹ í•˜ì—¬Â Routing Tableì— ì €ì¥ì‹œí‚¨ë‹¤.Â ë˜,Â ë™ì¼í•œ ì£¼ ë„¤íŠ¸ì›Œí¬ë¥¼ ì‚¬ìš©í•˜ëŠ” ê²½ìš°ë¼ë©´Â networkÂ ëª…ë ¹ìœ¼ë¡œ íŠ¹ì • ì¸í„°í˜ì´ìŠ¤ë¥¼ ë¼ìš°íŒ… í”„ë¡œì„¸ìŠ¤ì—ì„œ ì œì™¸í•  ìˆ˜ë„ ì—†ë‹¤.

8. R2-SW1Â êµ¬ê°„ì˜ ë§í¬ ì¥ì•  ì‹œÂ R2Â ë°Â R3ì˜ ë¼ìš°íŒ… í…Œì´ë¸” ë³€í™”ë¥¼ í™•ì¸í•˜ê³  í˜¸ìŠ¤íŠ¸Â Bì™€ í˜¸ìŠ¤íŠ¸Â Cê°€ ì¼ì •ì‹œê°„ í†µì‹  í•  ìˆ˜ ì—†ëŠ” ì´ìœ ì— ëŒ€í•´ ì„¤ëª…í•˜ì‹œì˜¤.

# ì„œë¸Œë„·íŒ… ë¬¸ì œ(ë‚œì´ë„ ë†’ìŒ)

ê´€ë¦¬ìëŠ” Point-to-Point ì„œë¸Œë„·(/30)ì´ 100ê°œ í•„ìš”í•˜ë‹¤

ì„œë¸Œë„·íŒ… í•œ í›„ í•˜ë‚˜ì˜ ì„œë¸Œë„· ì´ë¦„ì€ 1.1.1.0/30ì—¬ì•¼ í•œë‹¤

ì„œë¸Œë„·íŒ… í•˜ê¸° ì „ ë„¤íŠ¸ì›Œí¬ëŠ” ë¬´ì—‡ì´ì—ˆì„ê¹Œ?

```
í’€ì´
â”Œâ”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”
â”‚ NBâ”‚ SBâ”‚ HBâ”‚  
â””â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”€â”˜  ì´ 32ë¹„íŠ¸
2^n >= 100
n = 7
NB=23, SB=7, HB=2
1.1.1.0/23 NI?
	1.1.0.0/23
```

# Frame-Relayë¥¼ ì´ìš©í•œ ì‹¤ìŠµí™˜ê²½ ë§Œë“¤ê¸°

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/5a1f0a78-91d2-41af-96f5-ecf58b689826/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/5a1f0a78-91d2-41af-96f5-ecf58b689826/Untitled.png)

router : 2621xm, cloud : ì²«ë²ˆì§¸ generic, ëª¨ë“  router slotì¶”ê°€ : W1C-1T, ì—°ê²° : serial DCE ì„ 

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/ee5b7117-675f-40a6-981b-0c77ef2262ae/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/ee5b7117-675f-40a6-981b-0c77ef2262ae/Untitled.png)

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/c5873883-4a9d-4898-b042-1110fb1aa43d/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/c5873883-4a9d-4898-b042-1110fb1aa43d/Untitled.png)

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/76583be2-ce26-4663-813f-0dedba2e4aa7/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/76583be2-ce26-4663-813f-0dedba2e4aa7/Untitled.png)

---

ğŸ’¡ Frame-RelayëŠ” ì£½ì–´ê°€ëŠ” ì‹œì¥ì´ë‹¤. ê³µë¶€í•  í•„ìš” ì—†ë‹¤

1. Frame-Relayë¥¼Â ì´ìš©í•˜ì—¬Â ì‹¤ìŠµí™˜ê²½ì„Â êµ¬ì„±í•˜ëŠ” ì´ìœ Â 

    ë‹¤ì–‘í•œ í˜•íƒœì˜Â Topologyë¥¼Â (Bus, Ring, Star, Mesh)Â í…ŒìŠ¤íŠ¸ í•  ìˆ˜ ìˆë‹¤.Â 

    ìŠ¤ìœ„ì¹˜ì™€ ë¼ìš°í„° ê°„ì˜Â VLANÂ ë²ˆí˜¸ë¥¼ ì„ íƒí•˜ì—¬ êµ¬ì„±í•˜ëŠ” ê²ƒë³´ë‹¤ ê°„ë‹¨í•˜ë‹¤.

2. Routing Testë¥¼ ìœ„í•œ ë„¤íŠ¸ì›Œí¬ êµ¬ì„± ìˆœì„œÂ 

    ê° ë„¤íŠ¸ì›Œí¬ì˜ í† í´ë¡œì§€ëŠ” ë‹¤ë¥´ì§€ë§Œ ê¸°ë³¸ ì„¤ì •ë°©ë²•ì€ ë™ì¼í•˜ë‹¤.Â 

    IPÂ ì£¼ì†Œ í• ë‹¹ ë°Â Frame-Relay DLCIÂ ì§€ì •Â 

    Next Hop IPê¹Œì§€ì˜ í†µì‹  í™•ì¸Â 

    Routing ProtocolÂ ì„¸íŒ…Â 

    ì›ê²© ë„¤íŠ¸ì›Œí¬ë¡œ í†µì‹  í™•ì¸

3. Serial Sub-InterfaceÂ 

    ë¬¼ë¦¬ì ì¸Â Interfaceë¥¼ ë…¼ë¦¬ì ìœ¼ë¡œ ì—¬ëŸ¬ ê°œ ë‚˜ëˆˆ ê²ƒì„ ë§í•˜ë©°Â Point-to-Point, Multi-PointÂ ê°€ ìˆë‹¤.Â 

    ë™ì¼í•œÂ Sub-Interfaceë¥¼ í†µí•˜ì—¬Â 2ëŒ€ ì´ìƒì˜ ë¼ìš°í„°ì— ì—°ê²°í•˜ë ¤ë©´Â Multi-Pointë¥¼ ì‚¬ìš©í•œë‹¤.Â 

    í†µì‹ í•˜ë ¤ëŠ” ë¼ìš°í„° ê°„ì˜Â Sub-InterfaceëŠ” ê°™ì€ ì¢…ë¥˜ë¥¼ ì‚¬ìš©í•˜ëŠ” ê²ƒì´ ì¢‹ë‹¤.Â 

    Routing Protocolë“¤ì€ ë¬¼ë¦¬ì Â Interfaceì™€Â Multi-Pointë¥¼ ë™ì¼í•œ ê²ƒìœ¼ë¡œ ê°„ì£¼í•œë‹¤.Â 

    Sub-Interfaceê°€ ì •ì˜ëœ ë¬¼ë¦¬ì Â Interfaceì—ëŠ”Â IPÂ ì£¼ì†Œë¥¼ ë¶€ì—¬í•˜ì§€ ì•ŠëŠ”ë‹¤.Â 

    Sub-Interfaceë¥¼ í†µí•˜ì—¬ ì—°ê²°ëœ ë¼ìš°í„°ëŠ” ìƒëŒ€ ë¼ìš°í„°ê°€Â Sub-Interfaceë¡œ ì„¤ì •ëœ ê²ƒì„ ëª¨ë¥´ë©° ì•Œ í•„ìš”ë„ ì—†ë‹¤.

4. Frame-RelayÂ ë„¤íŠ¸ì›Œí¬ ì—°ê²°

    ![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/6fd332d6-4e10-49a8-b4b0-c9e2a43eeb0d/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/6fd332d6-4e10-49a8-b4b0-c9e2a43eeb0d/Untitled.png)

5. ë¼ìš°í„° ê¸°ë³¸ ì„¤ì •Â 

    ```
    R1(config)#interface Serial 1/0Â :Â ë¬¼ë¦¬ì  ì¸í„°í˜ì´ìŠ¤ ì„¤ì •ëª¨ë“œ ì§„ì…Â 
    R1(config-if)#encapsulation frame-relay :Â ì¸ìº¡ìŠë ˆì´ì…˜ íƒ€ì… ì„¤ì •Â 
    ~~R1(config-if)#no frame-relay inverse-arpÂ : DLCIÂ ì™€Â Next Hop IPÂ ìë™ ë§¤í•‘ ê¸°ëŠ¥ ì¤‘ì§€~~Â 
    R1(config-if)#no shutdownÂ :Â ì¸í„°í˜ì´ìŠ¤ í™œì„±í™”Â 
    R1(config-if)#int s0/0.12 point-to-point :Â ì„œë¸Œì¸í„°í˜ì´ìŠ¤ ë§Œë“¤ê¸°Â 
    R1(config-subif)#ip add 172.16.12.1 255.255.255.0 : IPÂ ì£¼ì†Œ ì„¤ì •Â 
    R1(config-subif)#frame-relay interface-dlci 102 : DLCIÂ ë²ˆí˜¸ ë§¤í•‘
    ```

    ```
    encapsulation frame-relay í™•ì¸
    ---------------------------------
    R1(config-if)#do sh int s0/0
    Serial0/0 is administratively down, line protocol is down (disabled)
      Hardware is HD64570
      MTU 1500 bytes, BW 128 Kbit, DLY 20000 usec,
         reliability 255/255, txload 1/255, rxload 1/255
      Encapsulation Frame Relay, loopback not set, keepalive set (10 sec)
    ```

6. Frame-RelayÂ ìš©ì–´Â 

    DLCI(Data-Link Connection Identifier)Â : Frame-Relayì—ì„œ ì‚¬ìš©í•˜ëŠ” ë…¼ë¦¬ì  ì£¼ì†Œì´ë©° í•˜ë‚˜ì˜ ë¬¼ë¦¬ì Â Interfaceì— ì—¬ëŸ¬ ê°œì˜Â DLCIë¥¼ ë§Œë“¤ì–´ ë‚´ì–´ íšŒì„ ì„ ë…¼ë¦¬ì ìœ¼ë¡œ ë‚˜ëˆ  ì“¸ ìˆ˜ê°€ ìˆë‹¤.

    LMI(Local Management Interface)Â : DLCIì™€ í•¨ê»˜ ì„¤ì •ëœÂ PVC(Permanent Virtual Circuit)ì •ë³´ë¥¼ ì•Œë ¤ ì¤Œìœ¼ë¡œì„œ ì¸í„°í˜ì´ìŠ¤ì˜ ë‹¤ì–‘í•œ ì •ë³´ì™€ ë™ì‘ ìƒíƒœ ë“±ì„ ì œê³µí•˜ëŠ” ê¸°ëŠ¥ì´ë‹¤.

7. Frame-Relay TopologyÂ êµ¬ì„± ì‹¤ìŠµÂ 

    Bus Topology

    ![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/298583f7-7768-4a7e-9ff6-53547453084f/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/298583f7-7768-4a7e-9ff6-53547453084f/Untitled.png)

    Ring Topology

    ![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/4022d7b9-d008-4c80-b98a-8f360e76a517/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/4022d7b9-d008-4c80-b98a-8f360e76a517/Untitled.png)

    Star Topology

    ![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/a062f7a2-2506-4dc8-8857-9c17136c9563/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/a062f7a2-2506-4dc8-8857-9c17136c9563/Untitled.png)
