# FHRP(First Hop Redundancy Protocol)

### FHRP의 개요

1. FHRP란 네트워크 게이트웨이 이중화 기술이다.
2. 네트워크 이중화 기술에서는 Backup, Redundancy, Failover, Switchover 등 여러 가지 용어를 사용하며 모두 비슷한 의미를 갖는다.
3. 네트워크 이중화 기술은 사용되는 장비와 설치 위치에 따라 다르다.
4. 주로 코어(Core)계층에서는 IGP를 이용하여 이중화를 하고, 분배(Distribute)계층의 L3스위치에서는 HSRP, VRRP, GLBP와 같은 Gateway 이중화 기술이 적용된다.
5. 게이트웨이 이중화 프로토콜 비교

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/fc1a3026-830b-40d0-9daf-132ec4c12469/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/fc1a3026-830b-40d0-9daf-132ec4c12469/Untitled.png)

### HSRP(Hot Standby Router Protocol)의 개요

1. CISCO에서 개발한 게이트웨이 이중화 프로토콜이다.
2. PC 또는 서버와 같은 종단장치들의 게이트웨이 장비(L3스위치, 라우터)에서 동작한다.
3. 종단장치들은 HSRP에서 사용하는 가상의 VIP를 게이트웨이로 설정하며 HSRP Active 권한의 장비가 실제 게이트웨이 역할을 하여 프레임을 처리한다.
4. HSRP Standby 장비는 HSRP Active 장비를 감시하다가 HSRP Active 장비가 다운되면 게이트웨이 역할을 이어 받게 된다.
5. 결과적으로 종단장치들은 하나의 게이트웨이(HSRP Active)가 다운되더라도 다른 장비(HSRP Standby)를 통해 외부 네트워크와 통신할 수 있다.

### HSRP 동작

1. HSRP는 Standby Group별로 한 개의 Active와 한 개의 Standby를 선출한다.
2. HSRP ver1의 목적지 주소는 224.0.0.2를 사용하고, HSRP ver2는 224.0.0.102를 사용한다.
3. UDP Port Number 1985번을 사용한다.
4. HSRP ver1은 Group Number 0~255를 사용하고, HSRP ver2는 Group Number 0~4095를 사용한다.
5. HSRP ver1의 Active 장비의 MAC Address는 0000.0c07.acNN (N=Group Number)이다.
6. HSRP ver2의 Active 장비의 MAC Address는 0000.0c9f.fNNN (N=Group Number)이다.

### HSRP ver1 Header(UDP)

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/5661208b-6aa6-40e0-bbe4-a965723c1c3b/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/5661208b-6aa6-40e0-bbe4-a965723c1c3b/Untitled.png)

1. Version: HSRP 버전 표시
2. Op Code: 동작 코드, 패킷 종류(0=Hello, 1=Coup, 2=Resign)
3. State: HSRP 상태(Initial, Learn, Listen, Speak, Standby, Active)
4. Hello Interval: 헬로 주기, 초 단위
5. Hold Time: 헬로 패킷을 못 받으면 해당 라우터가 다운되었다고 판단하는 시간, 초 단위
6. Priority: 값이 높으면 Active가 되고, 값이 같으면 IP주소가 높은 장비가 우선한다.
7. Group Number: HSRP 그룹번호
8. Authentication: 인증 암호, 8바이트(64bit)
9. Virtual IP: 가상 라우터의 IP 주소

### HSRP 상태변화

1. Initial: 시작상태. HSRP 설정을 변경하거나 인터페이스가 활성화 될 때의 상태.
2. Learn: 가상 IP 주소가 설정되지 않은 상태. Active로부터 Hello를 기다리는 상태.
3. Listen: 가상 IP 주소가 결정된 상태. 해당 라우터는 Active 또는 Standby가 아니다.
4. Speak: 주기적으로 Hello를 전송하기 시작한 상태. Active 선출에 참여
5. Standby: Active 라우터의 후보. 하나의 HSRP 그룹에는 하나의 Standby만 있다.
6. Active: HSRP 그룹의 가상 MAC 주소를 목적지로 하는 패킷을 라우팅한다. 하나의 HSRP 그룹에는 하나의 Active만 있다.

### 실습 네트워크 구성

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/3327a3ae-52c2-4a8b-85c1-1407532487f3/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/3327a3ae-52c2-4a8b-85c1-1407532487f3/Untitled.png)

### 실습 순서

1. 장치 연결
2. 라우터 및 스위치 기본 설정
3. Trunk (DTP) 설정
4. VTP 설정
5. VLAN 생성 및 할당
6. L3 인터페이스 IP 주소 설정
7. OSPF 설정
8. HSRP 설정
9. VLAN PC에서 서버로 통신 테스트(경로 확인)

### HSRP 설정 및 확인

```
SW1(config)# interface vlan [VLAN 번호]
SW1(config-if)# standby 1 ip [가상 IP 주소]
SW1(config-if)# standby 1 priority [값]
SW1(config-if)# standby 1 preempt
SW1(config-if)# standby 1 track [인터페이스명]
SW1# show standby
SW1# show standby brief
```

### VRRP(Virtual Router Redundancy Protocol)의 개요

1. VRRP란 네트워크 이중화 기술이다.
2. HSRP는 비 표준 프로토콜(시스코)이지만 VRRP는 표준 프로토콜이므로 멀티 벤더(Multi Vendor) 환경에서 게이트웨이 이중화 프로토콜로 사용된다.

### VRRP 동작

1. 게이트웨이 역할을 하는 장치를 마스터(Master)라고 하고 마스터 장애 시 역할을 대신하는 장치를 백업(Backup)이라고 한다.
2. 목적지 주소는 224.0.0.18을 사용하고, 프로토콜 번호 112이다.
3. 광고 주기는 1초가 기본값이고 Hold Time은 3초다.
4. 인터페이스에 설정된 실제 주소를 VIP로 사용할 수도 있고, HSRP처럼 별도의 VIP를 사용해도 된다.
5. VRRP 마스터 라우터 선출 우선순위는 아래와 같다.
    1. VIP와 실제 IP 주소가 같은 라우터
    2. VRRP Priority 값이 높은 라우터
    3. 인터페이스 IP 주소가 높은 라우터

### VRRP 설정 및 확인

```
SW1(config)# interface vlan [VLAN 번호]
SW1(config-if)# vrrp 1 ip [가상 IP 주소]
SW1(config-if)# vrrp 1 priority [값]
SW1(config-if)# vrrp 1 preempt delay minimum 100
SW1(config-if)# vrrp 1 timers advertise 1
SW1(config-if)# vrrp 1 timers learn
SW1(config-if)# vrrp 1 track [번호]
SW1(config)# track 1 interface [인터페이스명] line-protocol
SW1(config)# track 2 ip route 1.1.1.0/24 reachability
SW1# show vrrp
SW1# show vrrp brief
```

### GLBP(Gateway Load Balancing Protocol)의 개요

1. GLBP는 게이트웨이 이중화 기능을 제공하면서 별도의 설정없이 부하분산을 한다.
2. HSRP의 기능을 개선한 시스코 프로토콜이다.

### GLBP 동작

1. GLBP는 그룹당 하나의 VIP와 4개의 MAC 주소를 사용한다.
2. GLBP 라우터들은 동일한 출발지, 목적지 IP 주소 224.0.0.102 (UDP 3222)로 통신한다.
3. 그룹당 하나의 AVG(Active Virtual Gateway)을 선출하며 AVG 기능은 다음과 같다.
    1. GLBP 그룹 멤버들에게 Virtual MAC 주소를 할당하며 Virtual MAC 주소를 할당 받은 라우터를 AVF(Active Virtual Forwarder)라고 한다.
    2. PC로부터 게이트웨이 IP 주소에 대한 ARP 요청을 받으면 AVF의 MAC 주소들로 응답하여 부하분산을 만든다.

### GLBP 설정 및 확인

```
SW1(config)# interface vlan [VLAN 번호]
SW1(config-if)# glbp 1 ip [가상 IP 주소]
SW1(config-if)# glbp 1 priority [값]
SW1(config-if)# glbp 1 preempt delay minimum 50
SW1(config-if)# glbp 1 forwarder preempt delay minimum 50
SW1(config-if)# glbp 1 authentication text cisco
SW1(config-if)# glbp 1 authentication md5 key-string cisco
SW1# show glbp
SW1# show glbp brief
```

# HSRP 실습

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/66c1369e-2385-4fca-b070-160abe38293a/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/66c1369e-2385-4fca-b070-160abe38293a/Untitled.png)

### 장치 연결

- FHRP 실습은 IOU를 사용한다.

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/7a27932b-ea5b-4b63-bfff-0bf70ba643fb/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/7a27932b-ea5b-4b63-bfff-0bf70ba643fb/Untitled.png)

### 기본 설정

```
enable
configure terminal
line console 0
logging synchronous
exec-timeout 0
password console
login
exit
line vty 0 4
password telnet
login
exit
no ip domain-lookup
enable secret cisco
hostname
```

- IOU 스위치가 라우팅을 하려면 CEF 스위칭을 중지해야 한다. ( IOU 오류)

SW1(config)#no ip cef

### Trunk 설정

```
SW3(config)#int range e1/2 , e1/3
SW3(config-if-range)#switchport trunk encapsulation dot1q
SW3(config-if-range)#switchport mode trunk
```

### VTP 설정

```
SW1(config)#vtp domain CISCO
SW1(config)#vtp mode client
SW1(config)#vtp password cisco
SW2(config)#vtp domain CISCO
SW2(config)#vtp mode client
SW2(config)#vtp password cisco
SW3(config)#vtp domain CISCO
SW3(config)#vtp mode server
SW3(config)#vtp password cisco
```

### VLAN 생성 및 할당

```
SW3(config)#vlan 10
SW3(config-vlan)#name VLAN-10
SW3(config-vlan)#exit
SW3(config)#int range e0/0 - 1
SW3(config-if-range)#switchport mode access
SW3(config-if-range)#switchport access vlan 10
```

### Routed Port 및 SVI 설정

```
SW1(config)#int e1/0
SW1(config-if)#no switchport
SW1(config-if)#ip add 1.1.11.2 255.255.255.0
SW1(config-if)#no sh
SW1(config-if)#int vlan 10
SW1(config-if)#ip add 1.1.10.201 255.255.255.0
SW1(config-if)#no sh
SW2(config)#int e1/1
SW2(config-if)#no switchport
SW2(config-if)#ip add 1.1.12.2 255.255.255.0
SW2(config-if)#no sh
SW2(config-if)#int vlan 10
SW2(config-if)#ip add 1.1.10.202 255.255.255.0
SW2(config-if)#no sh
```

### L3 인터페이스 IP 주소 설정

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/b3317194-38dc-49c6-8a02-967904587986/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/b3317194-38dc-49c6-8a02-967904587986/Untitled.png)

```
R1(config)#int e0/0 
R1(config-if)#ip add 1.1.1.254 255.255.255.0 
R1(config-if)#no sh 
R1(config-if)#int e1/0 
R1(config-if)#ip add 1.1.11.1 255.255.255.0 
R1(config-if)#no sh 
R1(config-if)#int e1/1 
R1(config-if)#ip add 1.1.12.1 255.255.255.0 
R1(config-if)#no sh
```

### 라우팅(OSPF Area 0) 설정

```
- 광고가 불필요한 인터페이스는 차단한다. 
R1(config)#router ospf 1 
R1(config-router)#router-id 1.1.1.1 
R1(config-router)#network 1.1.1.254 0.0.0.0 a 0 
R1(config-router)#network 1.1.11.1 0.0.0.0 a 0 
R1(config-router)#network 1.1.12.1 0.0.0.0 a 0 
R1(config-router)#passive-interface e0/0 

SW1(config)#ip routing 
SW1(config)#router ospf 1 
SW1(config-router)#router-id 11.11.11.11 
SW1(config-router)#network 1.1.11.2 0.0.0.0 a 0 
SW1(config-router)#network 1.1.10.201 0.0.0.0 a 0 
SW1(config-router)#passive-interface vlan 10 

SW2(config)#ip routing 
SW2(config)#router ospf 1 
SW2(config-router)#router-id 22.22.22.22 
SW2(config-router)#network 1.1.12.2 0.0.0.0 a 0 
SW2(config-router)#network 1.1.10.202 0.0.0.0 a 0 
SW2(config-router)#passive-interface vlan 10
```

### HSRP 설정

- VLAN 10 PC들은 일반적으로 SW1을 통해 인터넷을 하고, SW1 경로에 장애 시 SW2을 통해 인터넷을 하도록 설정한다.

```
SW1(config)#int vlan 10 
SW1(config-if)#standby 10 ip 1.1.10.254 
SW1(config-if)#standby 10 priority 105 
SW1(config-if)#standby 10 preempt delay minimum 60 

SW2(config)#int vlan 10 
SW2(config-if)#standby 10 ip 1.1.10.254 
SW2(config-if)#standby 10 preempt
```

### HSRP 동작 확인

- 기본적으로 VLAN 10 PC들은 SW1을 통해서 인터넷이 된다.

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/c983df2f-3cc7-4833-a336-043620aa4ed1/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/c983df2f-3cc7-4833-a336-043620aa4ed1/Untitled.png)

- SW1에 장애 발생 시 SW2이 Active 권한을 얻어 PC들의 통신을 보장해 준다.

```
SW1(config)#int vlan 10 
SW1(config-if)#sh
```

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/877078e4-4257-4d4e-8c5a-5d716d7736db/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/877078e4-4257-4d4e-8c5a-5d716d7736db/Untitled.png)

- 다시 SW1에 장애 복구되면 SW1이 Active 권한을 얻게 된다.

```
SW1(config-if)#no sh
```

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/0dd97bdd-9a56-48bf-b542-2091429a17a7/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/0dd97bdd-9a56-48bf-b542-2091429a17a7/Untitled.png)

### Tracking 설정

- Tracking 설정 전에는 SW1의 외부 인터페이스(e1/0)에 장애 발생 시에는 SW1이 Active을 갖고 있으므로써 PC들이 인터넷(Server)과 통신이 단절된다.

```
SW1(config)#int e1/0 
SW1(config-if)#sh
```

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/3e08468f-eb19-470c-a50b-672711b0964d/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/3e08468f-eb19-470c-a50b-672711b0964d/Untitled.png)

- Tracking이란 외부 인터페이스 연결 장애 발생 시 Active권한을 Standby 장치에게 넘겨주어 PC들의 통신을 보장한다.

```
SW1(config)#int e1/0 
SW1(config-if)#no sh 

SW1(config)#int vlan 10 
SW1(config-if)#standby 10 track 1 
SW1(config-if)#exit 
SW1(config)#track 1 interface e1/0 line-protocol
```

- 평상시 SW1을 통해 인터넷을 한다.

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/9622e046-741f-4801-9fee-8fd744dcc111/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/9622e046-741f-4801-9fee-8fd744dcc111/Untitled.png)

- SW1의 외부 인터페이스가 다운되면 SW2이 Active가 된다.

```
SW1(config)#int e1/0 
SW1(config-if)#sh
```

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/c978c021-26dd-41f8-b694-f435fa34bd9f/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/c978c021-26dd-41f8-b694-f435fa34bd9f/Untitled.png)

- Tracking의 원리는 SW1의 외부 인터페이스 장애 시 SW1의 HSRP Priority를 10만큼 감소 시켜 Active 권한을 SW2에게 넘겨주게 된다.

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/40818077-38c4-4194-a889-a806e9bf31cc/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/40818077-38c4-4194-a889-a806e9bf31cc/Untitled.png)

### **MHSRP 설정**

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/bc374f92-3d83-4b7c-b60c-748556eb97a1/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/bc374f92-3d83-4b7c-b60c-748556eb97a1/Untitled.png)

### VLAN 설정 및 할당

```
SW3(config)#vlan 20
SW3(config-vlan)#name VLAN-20
SW3(config-vlan)#int e0/2
SW3(config-if)#switchport mode access
SW3(config-if)#switchport access vlan 20
```

### IP 주소 설정

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/ccb9db1e-8716-4acb-b547-2cff53ac4fad/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/ccb9db1e-8716-4acb-b547-2cff53ac4fad/Untitled.png)

```
SW1(config)#int vlan 20 
SW1(config-if)#ip add 1.1.20.201 255.255.255.0 
SW1(config-if)#no sh 

SW2(config)#int vlan 20  
SW2(config-if)#ip add 1.1.20.202 255.255.255.0 
SW2(config-if)#no sh
```

### OSPF 추가 설정

```
SW1(config)#router ospf 1
SW1(config-router)#network 1.1.20.201 0.0.0.0 a 0
SW1(config-router)#passive-interface vlan 20
SW2(config)#router ospf 1
SW2(config-router)#network 1.1.20.202 0.0.0.0 a 0
SW2(config-router)#passive-interface vlan 20
```

### MHSRP 설정

```
SW1(config)#int vlan 20
SW1(config-if)#standby 20 ip 1.1.20.254
SW1(config-if)#standby 20 preempt
SW2(config)#int vlan 20
SW2(config-if)#standby 20 ip 1.1.20.254
SW2(config-if)#standby 20 priority 105
SW2(config-if)#standby 20 preempt delay minimum 60
SW2(config-if)#standby 20 track 1
SW2(config-if)#exit
SW2(config)#track 1 int e1/1 line-protocol
```

# 네트워크망 구성

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/2369fee1-01ed-4a04-a8ee-52c5b851e2e3/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/2369fee1-01ed-4a04-a8ee-52c5b851e2e3/Untitled.png)

### 장치 연결

- IOU 장치를 사용한다.

(1) 네트워크 장치의 종류와 역할

- 1계층 (리피터, 허브): 다중접속, 신호 복제(플러딩), 신호 증폭
- 2계층 (브릿지, 스위치): 트랜스패런트 브릿징(러닝, 플러딩, 포워딩, 에이징, 필터딩)
- 3계층 (라우터, L3스위치): 경로 결정, 패킷 스위칭, Qos, 인증
- 4계층 (방화벽): IP주소 및 포트(TCP/UDP) 주소 필터링

(2) 인터페이스의 종류와 속도

- 콘솔(console), 옥스(Aux): 제어용 인터페이스(시스코 장치는 9600bps)
- 이더넷(Ethernet): 통신용 포트(10Mbps)
- 패스트 이더넷(Fast Ethernet): 통신용 포트(100Mbps)
- 기가비트 이더넷(Gigabit Ethernet): 통신용 포트(1Gbps)
- 10기가비트 이더넷(10Gigabit Ethernet): 통신용 포트(10Gbps)
- 시리얼(Serial): 전용회선, 통신용 포트(가입자와 통신회사 간의 계약에 따라 속도 정해진다.)

(3) 케이블 종류

- 다이렉트 케이블: 이기종 간에 연결시 사용(양쪽 모두 568B)
- 크로스 케이블: 같은 기종 간에 연결시 사용(한쪽은 568A이고, 다른 한쪽은 568B)
- Auto-MDI/MDI-X: Medium Dependent Interface, 케이블 자동 인식

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/091441d6-b206-42d0-b4f0-e8ad2eb96596/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/091441d6-b206-42d0-b4f0-e8ad2eb96596/Untitled.png)

### 기본 설정

(1) 네트워크 장치 제어 방법

- CLI(Command Line Interface) 모드: 명령어 모드, 콘솔로 접속하여 제어, 가장 일반적인 접속 제어 방법
- GUI(Ghraphic User Interface) 모드: 각 장치 제조사 런처 프로그램을 이용하여 제어. 주로 방화벽에서 사용
- 원격 접속: 텔넷 모드, SSH 모드 (제어하고자 하는 장치가 원거리에 있을 때 사용)

(2) 기본 설정

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/52227a18-ac6a-4640-9eae-5b491b927ca2/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/52227a18-ac6a-4640-9eae-5b491b927ca2/Untitled.png)

```
password console 
login 
exit 
line vty 0 4 
password telnet 
login 
exit 
no ip domain-lookup 
enable secret cisco 
hostname
```

### Trunk 설정(DTP 활용)

(1) 스위치의 L2포트 종류: IP 주소가 할당 불가능한 포트

- Access 포트: 하나의 VLAN 소속
- Trunk 포트: 복수의 VLAN 소속
- Tunnel 포트: 가입자와 통신회사 간의 계약된 포트

(2) 스위치의 L3포트 종류: IP 주소가 할당 가능한 포트

- Routed 포트: L3 스위치에서 'no switchport'라는 명령으로 생성되는 포트
- SVI 포트: VLAN당 하나씩 생성되는 논리적 포트(스위치의 관리 목적으로 주로 사용)

(3) DTP: 트렁킹 관련 현상하는 프로토콜, 시스코 프로토콜

```
DSW3(config)#int range e0/0 - 1 , e2/0 - 1 
DSW3(config-if-range)#switchport trunk encapsulation dot1q 
DSW3(config-if-range)#switchport mode trunk 

DSW4(config)#int range e0/0 - 1 , e2/2 - 3 
DSW4(config-if-range)#switchport trunk encapsulation dot1q 
DSW4(config-if-range)#switchport mode trunk
```

- ASW5, ASW6은 트렁크 설정을 생략해도 된다. (DTP가 기본적으로 동작하기 때문)

### 이더채널(Etherchannel) 설정

(1) 이더채널의 종류: 이더채널, 패스트이더채널, 기가이더채널, 10G이더채널

(2) 이더채널 프로토콜: LACP(표준), PAgP(시스코)

```
DSW3(config)#int range e0/0 - 1
DSW3(config-if-range)#channel-group 1 mode on
DSW4(config)#int range e0/0 - 1
DSW4(config-if-range)#channel-group 1 mode on
```

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/4685cadd-48ed-473f-994f-515fe1e40bd9/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/4685cadd-48ed-473f-994f-515fe1e40bd9/Untitled.png)

### VTP 설정

(1) VTP: VLAN 동기화 프로토콜

(2) VTP 모드

- 서버(Server): VLAN 생성/변경/삭제 가능, VLAN 전송/동기 가능(VTP 일련번호가 높은 장치에서 낮은 장치로 업데이트), VLAN 중계, 스위치의 VTP 기본값
- 클라이언트(Client): VLAN 생성/변경/삭제 불가능, VLAN 전송/동기 가능, VLAN 중계
- 트랜스패런트(Transparant): VLAN 생성/변경/삭제 가능, VLAN 전송/동기 불가능, VLAN 중계

```
[DSW3]
DSW3(config)#vtp domain CISCO
DSW3(config)#vtp mode server
DSW3(config)#vtp password cisco

[DSW4]~[ASW6]
DSW4(config)#vtp domain CISCO
DSW4(config)#vtp mode client
DSW4(config)#vtp password cisco
```

### VLAN 설정 및 할당

(1) VLAN: 논리적으로 분할된 스위치 기능

- VRF: 논리적으로 분할된 스위치 기능

(2) VLAN 특징

- 브로드캐스트 도메인 사이즈를 감소시켜 효율적인 트래픽 관리를 할 수 있다.

(브로드캐스트 도메인 사이즈는 감소하고, 브로드캐스트 도메인 수는 증가한다.)

- 네트워크 보안은 강화된다.
- 네트워크 설계 시 비용은 감소한다.

```
DSW3(config)#vlan 10,20
DSW3(config-vlan)#exit
ASW5(config)#int e3/0
ASW5(config-if)#sw m a
ASW5(config-if)#sw a v 10
ASW5(config-if)#int e3/1
ASW5(config-if)#sw m a
ASW5(config-if)#sw a v 20
ASW6(config)#int e3/0
ASW6(config-if)#sw m a
ASW6(config-if)#sw a v 10
ASW6(config-if)#int e3/1
ASW6(config-if)#sw m a
ASW6(config-if)#sw a v 20
```

### Root 스위치 조정

(1) STP 정의: 프레임 루프 방지 프로토콜

(2) STP 동작

- 루트 스위치 선출: 스위치 ID가 낮은 스위치가 루트 스위치가 된다.
- 루트 포트 선출: Non-Root 스위치에서 하나씩의 루트 포트를 선출한다.
- 지정 포트 선출: 세그먼트 당 하나씩의 지정 포트를 선출한다.
- 대체 포트 선출: 루트 포트 및 지정 포트가 아닌 포트는 모두 대체 포트가 되고 차단된다.

(3) 루트 스위치 조정: VLAN당 서로 다른 스위치를 루트 스위치 및 세컨더리 스위치로 선출하여 부하분산을 설계하는 것이 바람직하다.

```
DSW3(config)#spanning-tree vlan 10 priority 0
DSW3(config)#spanning-tree vlan 20 priority 4096
DSW4(config)#spanning-tree vlan 20 priority 0
DSW4(config)#spanning-tree vlan 10 priority 4096
```

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/3ab808d9-d979-4be6-9b60-1613f55bdc1b/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/3ab808d9-d979-4be6-9b60-1613f55bdc1b/Untitled.png)

### IP 주소 설정

```
10-1> ip 172.16.10.1 255.255.255.0 172.16.10.254
20-1> ip 172.16.20.1 255.255.255.0 172.16.20.254
10-2> ip 172.16.10.2 255.255.255.0 172.16.10.254
20-2> ip 172.16.20.2 255.255.255.0 172.16.20.254
WWW> ip 1.1.1.1 255.255.255.0 1.1.1.254
```

```
ISP(config)#int e0/0
ISP(config-if)#ip add 1.1.1.254 255.255.255.0
ISP(config-if)#no sh
ISP(config-if)#int e0/1
ISP(config-if)#ip add 1.1.11.1 255.255.255.0
ISP(config-if)#no sh
ISP(config-if)#int e0/2
ISP(config-if)#ip add 1.1.12.1 255.255.255.0
ISP(config-if)#no sh

HQ-R1(config)#int e0/1
HQ-R1(config-if)#ip add 1.1.11.2 255.255.255.0
HQ-R1(config-if)#no sh
HQ-R1(config-if)#int e1/0
HQ-R1(config-if)#ip add 172.16.13.1 255.255.255.0
HQ-R1(config-if)#no sh

HQ-R2(config)#int e0/2
HQ-R2(config-if)#ip add 1.1.12.2 255.255.255.0
HQ-R2(config-if)#no sh
HQ-R2(config-if)#int e1/1
HQ-R2(config-if)#ip add 172.16.24.2 255.255.255.0
HQ-R2(config-if)#no sh

DSW3(config)#int e1/0
DSW3(config-if)#no switchport
DSW3(config-if)#ip add 172.16.13.3 255.255.255.0
DSW3(config-if)#no sh
DSW3(config-if)#int vlan 10
DSW3(config-if)#ip add 172.16.10.203 255.255.255.0
DSW3(config-if)#no sh
DSW3(config-if)#int vlan 20
DSW3(config-if)#ip add 172.16.20.203 255.255.255.0
DSW3(config-if)#no sh

DSW4(config)#int e1/1
DSW4(config-if)#no switchport
DSW4(config-if)#ip add 172.16.24.4 255.255.255.0
DSW4(config-if)#no sh
DSW4(config-if)#int vlan 10
DSW4(config-if)#ip add 172.16.10.204 255.255.255.0
DSW4(config-if)#no sh
DSW4(config-if)#int vlan 20
DSW4(config-if)#ip add 172.16.20.204 255.255.255.0
DSW4(config-if)#no sh
```

### 라우팅(OSPF Area 0) 설정

- IGP로 가장 많이 사용하는 라우팅 프로토콜이다.
- 표준 라우팅 프로토콜로 호환성이 좋다.
- 링크 상태 라우팅 프로토콜이다.
- Area라는 개념으로 대규모에서 안정적으로 운영 가능하다.
- SVI 포트로는 OSPF 패킷을 모두 차단한다.

```
HQ-R1(config)#router ospf 1
HQ-R1(config-router)#router-id 1.1.1.1
HQ-R1(config-router)#network 172.16.13.1 0.0.0.0 a 0
HQ-R1(config-router)#default-information originate

HQ-R2(config)#router ospf 1
HQ-R2(config-router)#router-id 2.2.2.2
HQ-R2(config-router)#network 172.16.24.2 0.0.0.0 a 0
HQ-R2(config-router)#default-information originate

DSW3(config)#no ip cef
DSW3(config)#ip routing
DSW3(config)#router ospf 1
DSW3(config-router)#router-id 3.3.3.3
DSW3(config-router)#network 172.16.13.3 0.0.0.0 a 0
DSW3(config-router)#network 172.16.10.203 0.0.0.0 a 0
DSW3(config-router)#network 172.16.20.203 0.0.0.0 a 0
DSW3(config-router)#passive-interface default
DSW3(config-router)#no passive-interface e1/0

DSW4(config)#no ip cef
DSW4(config)#ip routing
DSW4(config)#router ospf 1
DSW4(config-router)#router-id 4.4.4.4
DSW4(config-router)#network 172.16.24.4 0.0.0.0 a 0
DSW4(config-router)#network 172.16.10.204 0.0.0.0 a 0
DSW4(config-router)#network 172.16.20.204 0.0.0.0 a 0
DSW4(config-router)#passive-interface default
DSW4(config-router)#no passive-interface e1/1
```

### NAT-PAT 설정

- 정적 NAT: 변환되기 전 주소와 변환 후 주소가 1:1로 매핑된다. 주로 외부에서 내부 장치에 접속할 때 사용한다.
- 동적 NAT: 변환되기 전 주소와 변환 후 주소가 M:N으로 매핑된다. 일반적으로 외부에서 내부로 통신은 불가능하다.
- NAT-PAT: 변환되기 전 주소와 변환 후 주소가 M:1으로 매핑된다.

```
HQ-R1(config)#ip route 0.0.0.0 0.0.0.0 e0/1 1.1.11.1
HQ-R1(config)#access-list 1 permit 172.16.0.0 0.0.255.255
HQ-R1(config)#ip nat inside source list 1 int e0/1 overload
HQ-R1(config)#int e0/1
HQ-R1(config-if)#ip nat outside
HQ-R1(config-if)#int e1/0
HQ-R1(config-if)#ip nat inside

HQ-R2(config)#ip route 0.0.0.0 0.0.0.0 e0/2 1.1.12.1
HQ-R2(config)#access-list 1 permit 172.16.0.0 0.0.255.255
HQ-R2(config)#ip nat inside source list 1 int e0/2 overload
HQ-R2(config)#int e0/2
HQ-R2(config-if)#ip nat outside
HQ-R2(config-if)#int e1/1
HQ-R2(config-if)#ip nat inside
```

### MHSRP 설정

```
DSW3(config)#int vlan 10 
DSW3(config-if)#standby 10 ip 172.16.10.254 
DSW3(config-if)#standby 10 priority 105 
DSW3(config-if)#standby 10 preempt delay minimum 40 
DSW3(config-if)#standby 10 track 1 
DSW3(config-if)#exit 
DSW3(config)#track 1 int e1/0 line-protocol 
 
DSW4(config)#int vlan 10 
DSW4(config-if)#standby 10 ip 172.16.10.254 
DSW4(config-if)#standby 10 preempt 
 
DSW3(config)#int vlan 20 
DSW3(config-if)#standby 20 ip 172.16.20.254  
DSW3(config-if)#standby 20 preempt

DSW4(config)#int vlan 20 
DSW4(config-if)#standby 20 ip 172.16.20.254 
DSW4(config-if)#standby 20 priority 105 
DSW4(config-if)#standby 20 preempt delay minimum 40 
DSW4(config-if)#standby 20 track 1 
DSW4(config-if)#exit 
DSW4(config)#track 1 int e1/1 line-protocol
```
