# LAN 스위칭(Switching) 정의

LAN 스위칭(Switching)은 근거리 통신망에서 사용하는 패킷 교환 형태를 말한다. 이더넷 스위치(Ethernet Switch)는 특정 인터페이스를 통해 들어오는 프레임(Frame)의 출발지 MAC 주소를 학습하고, 목적지 MAC 주소를 읽어 해당 인터페이스를 통하여 프레임을 전송시켜 주는 역할을 하며 이를 LAN 스위칭(Switching)이라고 한다.

### 이더넷 스위치의 종류

1. 모양에 따른 분류

    ![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/05a3d9da-caed-4616-b2e1-ccc3e787a87c/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/05a3d9da-caed-4616-b2e1-ccc3e787a87c/Untitled.png)

2. 기능에 따른 분류

    ![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/6a784910-2d4c-4303-bc20-66241d10345e/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/6a784910-2d4c-4303-bc20-66241d10345e/Untitled.png)

3. 시스코 이더넷 스위치는 크게 Catalyst 시리즈와 Nexus 시리즈가 있으며 일반적으로 많이 사용되는 것은 가격이 저렴한 Catalyst 시리즈이다.

### 허브(Hub)와 스위치(Switch)

1. 허브는 특정 포트로 들어오는 비트(Bit, 전기적 신호)를 활성화 되어 있는 모든 포트로 복사 및 증폭하여 전송하며 다중 접속 및 전송거리 연장을 목적으로 사용한다. 이처럼 수신한 신호를 모든 포트로 복사 전송하는 것을 플러딩(Flooding)이라고 한다.
2. 스위치는 특정 포트로 들어오는 프레임(Frame)의 목적지 MAC 주소를 확인하고 MAC 주소 테이블에 기반하여 해당 포트로 포워딩(Forwarding)한다.

### MAC Address Table

스위치는 특정 포트로 수신되는 프레임의 출발지 MAC 주소와 포트 번호를 학습하여 기록하며 이를 MAC Address Table이라고 하고, CAM(Content Address Memory)라고도 한다.

### 트랜스패런트 브리징(Transparent Bridging) 정의

이더넷 스위치는 MAC Address Table을 기반으로 특정 인터페이스로 들어오는 프레임의 목적지를 읽고 해당 인터페이스로 전송한다. 이 때 MAC Address Table을 만들고, 유지하며, 프레임을 전송하는 것을 트랜스패런트 브리징(Transparent Bridging)이라고 한다.

1. 러닝(Learning)
    1. 이더넷 프레임이 스위치에 특정 포트로 들어올 때 MAC Address Table에 해당 출발지 MAC 주소가 없으면 출발지 MAC 주소와 수신 포트를 기록한다.
    2. 출발지 MAC 주소가 MAC Address Table에 있으면 다음 과정으로 넘어간다.
2. 플러딩(Flooding)
    1. 목적지 MAC 주소가 브로드캐스트 주소 또는 멀티캐스트 주소이거나, MAC Address Table에 없는 유니캐스트 주소이면 수신 포트를 제외한 동일한 VLAN에 속하는 모든 포트로 복사하여 전송한다.
3. 포워딩(Forwarding)
    1. 목적지 MAC 주소가 MAC Address Table에 존재하면 해당 유니캐스트 프레임을 목적지 포트로 전송한다.
4. 에이징(Aging)
    1. 이더넷 프레임의 출발지 MAC 주소를 러닝한 후 에이징 타이머(Aging Timer)를 작동시킨다.
    2. MAC 주소 테이블에 해당 주소가 있으면 타이머를 초기화하며, 일정 시간 동안 해당 프레임이 더 이상 활동이 없으면 MAC Address Table에서 해당 정보를 삭제한다.
    3. 일반적으로 시스코 스위치의 에이징 타임은 5분이다.
5. 필터링(Filtering)
    1. MAC Address Table에 출발지 및 목적지 주소가 동일하면 해당 프레임의 전송을 차단한다.
    2. 목적지 호스트의 이중 프레임 수신을 막는다.

# Port Security

### 포트 보안(Port Security)

1. 포트 보안(Port Security)은 스위치의 특정 포트에 특정 MAC 주소를 가진 장비만 접속하여 사용할 수 있도록 하는 것이다.
2. 포트 보안을 사용하면 MAC 플러딩 공격 등을 효과적으로 방어할 수 있다.

### 정적 MAC 주소 테이블

1. MAC Address Table 확인

    ```
    SW1# show mac-address-table
    SW1# show mac address-table
    ```

2. MAC Address Table 최대 카운트

    ```
    SW1# show mac-address-table count
    ```

3. 정적 MAC Address Table 등록

    ```
    SW1(config)# mac-address-table static 0000.0000.0001 interface f0/1 vlan 1
    ```

목적지 MAC 주소와 연결되는 포트명과 소속된 VLAN 번호를 지정한다.

### 포트 보안 설정

```
1. SW1(config-if)# switchport mode access 
2. SW1(config-if)# switchport port-security mac-address 0000.0000.0001 
3. SW1(config-if)# switchport port-security 
4. SW1# show port-security
```

1. 스위치 포트 모드를 액세스로 설정한다. (트렁크 모드는 보안포트가 될 수 없다.)
2. 접속을 허용할 MAC 주소를 지정한다.
3. 포트 보안을 동작시킨다.
4. 포트 보안 동작 상태를 확인한다.

### 포트 보안 옵션

```
1. SW1(config-if)# switchport port-security maximum [Number] 
2. SW1(config-if)# switchport port-security violation [Option] 
3. SW1(config-if)# switchport port-security mac-address [MAC Address]
```

1. 포트 보안용 MAC 주소 수량을 지정한다.
2. 포트 보안 침해가 발생할 때의 동작을 정의한다.
3. 포트 보안용 MAC 주소를 지정하는 방법은 3가지이다.
    1. MAC 주소를 지정하지 않으면 첫 번째 MAC 주소가 포트 보안용 MAC주소이다.
    2. MAC 주소를 직접 지정한다.
    3. Sticky 옵션으로 설정하면 다수의 MAC 주소를 포트 보안용 MAC 주소로 사용할 수 있다.

# VLAN

### VLAN 개요와 사용하는 이유

1. 논리적으로 분할된 스위치이다.
2. 네트워크상에 직접 연결된 장비들간에 발생하는 Broadcast Traffic으로 인해 유발되는 네트워크 혼잡을 방지할 수 있다. 즉 VLAN 내부의 장비들끼리만 Broadcast Traffic의 영향을 받는다.
3. 같은 VLAN 내의 장비들끼리만 의사소통이 가능하며 다른 VLAN과의 통신은 Routing을 통해 가능하므로 Layer2 에서 간접적인 보안을 유지할 수 있다.
4. 네트워크상의 장비의 증설이나 이동 변경 시 물리적 연결이 아닌 논리적 변경에 의해서 가능하므로 작업이 용이하다.

### VLAN 번호

1. VLAN은 번호(ID)로 구분한다.
2. 사용 가능한 VLAN 번호는 1~4094 이고, 1~1005을 Normal VLAN이라고 한다.
3. 1002~1005번은 Token Ring 및 FDDI 용이다. (거의 사용하지 않는다.)
4. Ethernet에서 사용하는 VLAN 번호는 1~1001까지이다.
5. 1006~4094번은 Extended VLAN이라고 하며, 실제 사용 가능한 VLAN 번호는 스위치에 따라 다르다.

### VLAN 설정

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/b8ed4079-8c05-4dab-9707-d5bc5808f9fc/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/b8ed4079-8c05-4dab-9707-d5bc5808f9fc/Untitled.png)

1. VLAN 생성

    ```
    SW1(config)# vlan [VLAN ID]
    SW1(config-vlan)# name [Word]
    ```

2. VLAN 할당

    ```
    SW1(config-if)# switchport mode access
    SW1(config-if)# switchport access vlan [VLAN ID]
    ```

3. Trunk 설정

    ```
    SW1(config-if)# switchport trunk encapsulation dot1Q
    SW1(config-if)# switchport mode trunk
    ```

4. Inter-VLAN 설정

    ```
    R1(config)# interface fa1/0
    R1(config-if)# no shutdown
    R1(config-if)# interface fa1/0.10
    R1(config-subif)# encapsulation dot1Q 10
    R1(config-subif)# ip add 192.168.10.254 255.255.255.0
    ```

5. VLAN 구성 후 확인

    ```
    SW1# show vlan-switch brief
    SW1# show interface trunk
    ```

### Trunk

1. Trunk Port는 복수의 VLAN에 소속된 포트이다.
2. 반대로 하나의 VLAN에 소속된 포트를 Access Port라고 한다.
3. Trunk Port가 사용하는 프로토콜을 Trunking Protocol이라고 한다.
4. Trunking Protocol은 스위치에서 Broadcast Frame을 전송할 때 VLAN 번호를 표시하여 Trunk Port에 전송 하도록 한다.
5. Trunking Protocol을 Trunking Encapsulation이라고도 한다.
6. Trunking Encapsulation은 802.1Q와 ISL 두 가지가 있다.
7. 주로 802.1Q를 사용한다.

### 802.1Q Trunking

1. 802.1Q 프레임 포맷

    ![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/94674866-c934-4010-a118-2515b6fbd264/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/94674866-c934-4010-a118-2515b6fbd264/Untitled.png)

2. Ethertype: 현재 프레임이 802.1Q 프레임이라는 것을 표시 (항상 0x8100)
3. Priority: 프레임 우선순위. CoS(Class of Service)라고도 하며 0~7의 값을 갖는다.
4. CFI: Token Ring 인지 아닌지 구분할 수 있는 필드 (1이면 Token Ring)
5. VLAN ID: 프레임의 VLAN ID 표시

### Native VLAN

1. Trunk Port로 전송 시 VLAN을 표시하지 않고 전송하는 VLAN이다.
2. 802.1Q 에서만 사용한다.
3. 스위치의 기본 Native VLAN ID는 1번이며 되도록 다른 ID로 바꾸는 것이 좋다.

    ```
    SW1(config-if)# switchport trunk native [VLAN ID]
    ```

### ISL (Inter-switch Link)

1. CISCO에서 개발한 Trunking Protocol이다.
2. Extended VLAN 을 지원하지 못하며 802.1Q로 대체되고 있는 추세다.
3. Ethernet 헤더 앞에 ISL 헤더(26Bytes)가 붙고 Ethernet FCS 뒤에 ISL FCS(4Bytes)가 붙는다.
4. ISL 헤더의 주요 필드는 아래와 같다.
    1. DA: ISL Frame이라는 것을 표시
    2. User: Ethernet Frame의 우선순위 표시
    3. VLAN ID: 15bit가 할당되어 있으나 실제로 10bit만 사용 (1024번까지 지원)
    4. BPDU: 루프방지를 위한 STP의 정보. 스위치 사이에 정보 교환하는 데이터
5. ISL 캡슐화 설정

    ```
    SW1(config-if)# switchport trunk encapsulation ISL
    ```

### DTP (Dynamic Trunking Protocol)

1. DTP란 시스코 스위치 사이에서 상대 스위치와 Trunk 관련 사항을 협상할 때 사용하는 프로토콜이다.

    ![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/06e6d250-e56c-421f-9cab-2b246b78a44f/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/06e6d250-e56c-421f-9cab-2b246b78a44f/Untitled.png)

2. DTP Mode 설정

    ```
    SW1(config-if)# switchport mode [access / trunk / dynamic desirable / dynamic auto]
    ```

### VTP (VLAN Trunking Protocol)

1. 스위치에 설정된 VLAN과 Name을 다른 스위치에 광고하는 프로토콜이다.
2. Configuration Revision은 VLAN 생성, 변경, 삭제 시에 기존 값에 1씩 증가 시킨다.
3. VTP를 수신한 스위치는 자신의 Revision과 비교하여 같으면 무시하고 수신한 Revision이 낮으면 자신의 VLAN정보를 전송하고 수신한 Revision이 높으면 새로 업데이트 한다.
4. VTP가 동작하기 위해서는 상호 Trunk Port로 동작해야 한다.
5. VTP 모드는 Server, Client, Transparent 가 있다.

    ![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/620e91ad-26da-4709-80c0-a955157524ef/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/620e91ad-26da-4709-80c0-a955157524ef/Untitled.png)

6. VTP 설정

    ```
    SW1(config)# vtp domain CISCO
    SW1(config)# vtp mode [server / client / transparent]
    SW1(config)# vtp password [PW]
    ```

7. 새로운 스위치를 추가할 때는 VTP 설정 번호를 반드시 초기화 해 주어야 한다. 초기화하지 않고 연결할 경우 모든 스위치에 영향을 줄 수도 있다.

    ```
    1. VTP Domain Name을 변경 
    2. VTP 모드를 Trasparent로 변경 
    3. VLAN Database(vlan.dat)를 삭제하고 재부팅 SW1# delete vlan.dat SW1# reload
    ```
