# GRE Tunnel

### GRE Tunnel (Generic Routing Encapsulation Tunnel)

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/aa0d2419-8c69-4eb3-a982-d3127dc981bf/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/aa0d2419-8c69-4eb3-a982-d3127dc981bf/Untitled.png)

### GRE 실습 네트워크 구성도

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/781c714a-2e79-4869-8c0a-857adc9125d8/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/781c714a-2e79-4869-8c0a-857adc9125d8/Untitled.png)

### GRE Tunnel 설정

```
R1(config)#interface tunnel [번호] 
R1(config-if)#ip address [IP] [SM] 
R1(config-if)#tunnel mode gre ip (기본값) 
R1(config-if)#tunnel source [인터페이스명] 
R1(config-if)#tunnel destination [목적지 IP 주소] 

R1#show ip int brief
```

### 장치 연결

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/3937215f-cf61-4209-96ed-2b2022ee10a2/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/3937215f-cf61-4209-96ed-2b2022ee10a2/Untitled.png)

### 기본 설정

```
enable
configure terminal
line console 0
logging synchronous
exec-timeout 0
password console
login
exit
line vty 0 4
password telnet
login
exit
no ip domain-lookup
enable secret cisco
hostname
```

### IP 주소 설정

```
R1(config)#int lo0
R1(config-if)#ip add 172.16.1.1 255.255.255.0
R1(config-if)#no sh
R1(config-if)#int f0/0
R1(config-if)#ip add 1.1.12.1 255.255.255.0
R1(config-if)#no sh

R2(config)#int f0/0
R2(config-if)#ip add 1.1.12.2 255.255.255.0
R2(config-if)#no sh
R2(config-if)#int f0/1
R2(config-if)#ip add 1.1.23.2 255.255.255.0
R2(config-if)#no sh
R2(config-if)#int f1/0
R2(config-if)#ip add 1.1.24.2 255.255.255.0
R2(config-if)#no sh

R3(config)#int lo0
R3(config-if)#ip add 172.16.3.3 255.255.255.0
R3(config-if)#no sh
R3(config-if)#int f0/0
R3(config-if)#ip add 1.1.23.3 255.255.255.0
R3(config-if)#no sh

R4(config)#int lo0
R4(config-if)#ip add 172.16.4.4 255.255.255.0
R4(config-if)#no sh
R4(config-if)#
R4(config-if)#int f0/0
R4(config-if)#ip add 1.1.24.4 255.255.255.0
R4(config-if)#no sh
```

### 기본 경로 설정

```
R1(config)#ip route 0.0.0.0 0.0.0.0 1.1.12.2
R3(config)#ip route 0.0.0.0 0.0.0.0 1.1.23.2
R4(config)#ip route 0.0.0.0 0.0.0.0 1.1.24.2
```

- 원격 장치 간 통신 확인

    ![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/dd11a35c-1c22-48ac-9819-2b043809220d/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/dd11a35c-1c22-48ac-9819-2b043809220d/Untitled.png)

### GRE Tunnel 설정

```
R1(config)#int tunnel 13 
R1(config-if)#ip add 172.16.13.1 255.255.255.0 
R1(config-if)#no sh 
R1(config-if)#tunnel mode gre ip 
R1(config-if)#tunnel source f0/0 
R1(config-if)#tunnel destination 1.1.23.3 

R3(config)#int tunnel 13 
R3(config-if)#ip add 172.16.13.3 255.255.255.0 
R3(config-if)#tunnel mode gre ip 
R3(config-if)#tunnel source f0/0 
R3(config-if)#tunnel destination 1.1.12.1 
R3(config-if)#no sh

R1(config)#int tunnel 14 
R1(config-if)#ip add 172.16.14.1 255.255.255.0 
R1(config-if)#tunnel mode gre ip 
R1(config-if)#tunnel source f0/0 
R1(config-if)#tunnel destination 1.1.24.4 
R1(config-if)#no sh 

R4(config)#int tunnel 14 
R4(config-if)#ip add 172.16.14.4 255.255.255.0 
R4(config-if)#tunnel mode gre ip 
R4(config-if)#tunnel source f0/0 
R4(config-if)#tunnel destination 1.1.12.1 
R4(config-if)#no sh
```

### 라우팅(RIPv2) 설정

```
[R1] [R3] [R4] 명령 동일 

R1(config)#router rip 
R1(config-router)#ver 2 
R1(config-router)#network 172.16.0.0
```

원격 로컬 간 통신 확인

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/a27a0907-c483-40ba-9eac-f700eedc2635/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/a27a0907-c483-40ba-9eac-f700eedc2635/Untitled.png)

# IPv6 Address

### IPv6의 개요와 특징

1. IPv4 주소의 고갈 문제를 해결하기 위해 도입된 차세대 IP 주소이다.
2. 128 비트(Bit)이며, 16진수로 표시한다.
3. 8개의 그룹으로 되어 있고 그룹간 콜론( : )으로 구분한다.
4. 1개 그룹은 16비트이다.
5. 네트워크 마스크는 ‘/n’으로 표시한다.
6. 각 그룹에서 앞부분의 0은 생략하여 표시할 수 있다.
7. 그룹 전체가 0일 경우 콜론 2개( :: )를 사용하여 생략할 수 있지만 하나의 주소에서 한번만 사용 가능하다.
    1. 2000:0010:0000:0001:0000:0000:0000:0001
    2. 2000:10:0:1::1

### IPv6 주소 분류

1. Global Unicast 주소
    1. 공인 IPv6 주소를 의미하며 2000::/3로 시작한다.
    2. 첫 그룹의 첫 문자가 2 또는 3인 주소다.
    3. Global Unicast 주소는 동일한 인터페이스에 여러 개 설정할 수 있다.
2. Link Local 주소
    1. FE80::/10로 시작한다.
    2. 특정 장비의 특정 인터페이스 및 그 인터페이스와 직접 연결된 장비에서만 사용한다.
3. Multicast 주소
    1. FF00::/8 이다.
    2. IPv6에서는 Broadcast 주소는 사용하지 않는다.
4. Anycast 주소
    1. 복수개의 라우터에 동일한 주소를 부여하는 것을 말한다.
    2. 주소를 할당할 때 마지막에 Anycast 옵션을 사용한다.
5. Loopback 주소
    1. 루프백은 장비 자신의 주소다.
    2. ::1/128 이다.
    3. 

### IPv6와 IPv4 동시 사용

1. Dual Stack: 동일한 네트워크에 IPv4와 IPv6를 별개로 동작시키는 방법
2. Tunneling: IPv4 패킷에 IPv6 패킷을 실어서 전송하거나 반대로 하는 방법
3. NAT-PT(NAT-Protocol Translation): IPv6 패킷을 IPv4 패킷으로 변환하는 방법으로 표준화 되었으나 변환 알고리즘의 복잡성으로 현재는 사용 안 한다고 규정했다. (RFC 4966)

### 네트워크 구성도

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/b9450153-8118-4514-987a-4b66be461580/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/b9450153-8118-4514-987a-4b66be461580/Untitled.png)

### IPv6 주소 설정

```
R1(config)# ipv6 unicast-routing 
R1(config)# interface f0/0 
R1(config-if)# ipv6 address 3000:1:1:1::2/64 
R1(config-if)# no shutdown 
R1(config-if)# ipv6 rip 100 enable 
R1# show ipv6 interface brief 
R1# show ipv6 route 

* R1(config-if)# ipv6 address 3000:1:1:1::/64 eui-64
```

# IPv6 Routing

### IPv6 Routing의 개요와 특징

1. IPv6 주소를 사용하는 라우팅을 말한다.
2. IPv4에서 사용하는 정적 및 동적(RIP, EIGRP, OSPF, BGP 등) 프로토콜을 모두 사용할 수 있다.
3. IPv4와 IPv6 라우팅 프로토콜 이름

    ![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/804f1ffa-d033-4975-b4d2-a113206eb5a0/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/804f1ffa-d033-4975-b4d2-a113206eb5a0/Untitled.png)

### 네트워크 구성도

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/cf77a55d-836d-4265-a8f2-68d1f9641133/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/cf77a55d-836d-4265-a8f2-68d1f9641133/Untitled.png)

### IPv6 Static

1. 장치 연결
2. 라우터 기본 설정
3. 인터페이스 IPv6 주소 설정

    ```
    Rx(config)#interface [Interface Name]
    Rx(config-if)#ipv6 address [IPv6 Address/Mask]
    Rx(config-if)#no shutdown
    ```

4. 인접 장치 간 통신 테스트

    ```
    Rx#ping [Next Hop IPv6 Address]
    ```

5. IPv6 Static 설정

    ```
    Rx(config)# ipv6 route [Destination Network] [SM] [Next hop IPv6 / Local Interface Name]
    ```

Broadcast(Ethernet)을 통한 경로에는 Local Interface Name을 사용할 수 없고 Next hop IPv6으로 설정해야 한다.

### RIPng

1. RIPng 설정

```
Rx(config)#ipv6 unicast-routing
Rx(config)#interface [Interface Name]
Rx(config-if)#Ipv6 rip [RIP Database Name] enable
```

1. IPv6 rip 다음에 오는 Database 이름은 하나의 라우터에서 복수의 RIPng를 설정 시 구분되며 라우터 간에 서로 달라도 된다.
2. RIPng 라우팅 테이블 및 원격장치 통신 테스트

```
R1#show ipv6 route
R1#ping 2000:1:1:4::4 source 2000:1:1:1::1
```

### EIGRP for IPv6

1. EIGRP for IPv6 설정

```
Rx(config)#ipv6 unicast-routing
Rx(config)#ipv6 router eigrp [AS Number]
Rx(config-rtr)#eigrp router-id [IPv4 Address Format]
Rx(config-rtr)#interface [Interface Name]
Rx(config-if)#ipv6 eigrp [AS Number]
```

1. EIGRP for IPv6 확인

```
R1#show ipv6 eigrp neighbors
R1#show ipv6 eigrp topology [All-link]
R1#show ipv6 route
```

### OSPFv3

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/54df21d0-4139-4ef1-ad21-340207acb905/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/54df21d0-4139-4ef1-ad21-340207acb905/Untitled.png)

### OSPFv3 설정

```
Rx(config)#no ipv6 router eigrp [AS Number]
Rx(config)#no ipv6 router rip [RIP Database Name]
Rx(config)#ipv6 unicast-routing
Rx(config)#ipv6 router ospf [Process ID]
Rx(config-rtr)#router-id [IPv4 Address Format]
Rx(config-rtr)#interface [Interface Name]
Rx(config-if)#ipv6 ospf [Process ID] area [area ID]
```

### OSPFv3 확인

```
Rx#show ipv6 route ospf
Rx#show ipv6 ospf neighbor
Rx#show ipv6 ospf interface [Interface Name]
Rx#show ipv6 protocols
```

### OSPFv2와 OSPFv3 코드 비교

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/8b23455c-36b9-4580-9a15-9ce50c836e48/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/8b23455c-36b9-4580-9a15-9ce50c836e48/Untitled.png)

# IPv6 Routing 실습

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/0779032f-e96a-4045-958e-ee36977d1cc7/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/0779032f-e96a-4045-958e-ee36977d1cc7/Untitled.png)

### 장치 연결

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/07abd28a-90cb-49e0-8796-9950956b08d1/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/07abd28a-90cb-49e0-8796-9950956b08d1/Untitled.png)

라우터에 NM-4T장착

### 기본 설정

```
enable 
configure terminal 
line console 0 
logging synchronous 
exec-timeout 0 
password console 
login 
exit 
line vty 0 4 
password telnet 
login 
exit 
no ip domain-lookup 
enable secret cisco 
hostname
```

### IPv6 주소 설정

```
R1(config)#int lo0 
R1(config-if)#ipv6 address 2000:1:1:1::1/64 
R1(config-if)#no sh 
R1(config-if)#int f0/1 
R1(config-if)#ipv6 address 2000:1:1:12::1/64 
R1(config-if)#no sh 
R1(config-if)#int s1/0 
R1(config-if)#ipv6 address 2000:1:1:13::1/64 
R1(config-if)#no sh 

R2(config)#int f0/1 
R2(config-if)#ipv6 add 2000:1:1:12::2/64 
R2(config-if)#no sh 
R2(config)#int f0/0 
R2(config-if)#ipv6 address 2000:1:1:234::2/64 
R2(config-if)#no sh 

R3(config)#int s1/0 
R3(config-if)#ipv6 add 2000:1:1:13::3/64 
R3(config-if)#no sh 
R3(config-if)#int f0/0 
R3(config-if)#ipv6 add 2000:1:1:234::3/64 
R3(config-if)#no sh 

R4(config)#int lo0 
R4(config-if)#ipv6 add 2000:1:1:4::4/64 
R4(config-if)#no sh 
R4(config-if)#int f0/0 
R4(config-if)#ipv6 add 2000:1:1:234::4/64 
R4(config-if)#no sh 

- 인접 장치 간 통신 확인
- 저장
```

### 정적 IPv6 Routing 설정

```
R1(config)#ipv6 unicast-routing 
R1(config)#ipv6 route 2000:1:1:234::/64 f0/1 2000:1:1:12::2 
R1(config)#ipv6 route 2000:1:1:234::/64 s1/0 2000:1:1:13::3 2 
R1(config)#ipv6 route 2000:1:1:4::/64 f0/1 2000:1:1:12::2 
R1(config)#ipv6 route 2000:1:1:4::/64 s1/0 2000:1:1:13::3 2 

R2(config)#ipv6 unicast-routing 
R2(config)#ipv6 route 2000:1:1:1::/64 f0/1 2000:1:1:12::1 
R2(config)#ipv6 route 2000:1:1:4::/64 f0/0 2000:1:1:234::4 

R3(config)#ipv6 unicast-routing 
R3(config)#ipv6 route 2000:1:1:1::/64 s1/0 2000:1:1:13::1 
R3(config)#ipv6 route 2000:1:1:4::/64 f0/0 2000:1:1:234::4 

R4(config)#ipv6 unicast-routing 
R4(config)#ipv6 route 2000:1:1:1::/64 f0/0 2000:1:1:234::2 

- 원격 장치 간 통신 확인
- 다음 실습을 위해 IPv6 Static Routing 설정을 모두 삭제한다.
```

### RIPng 설정

```
R1(config)#ipv6 router rip TEST 
R1(config-rtr)#int lo0  
R1(config-if)#ipv6 rip TEST enable 
R1(config-if)#int f0/1 
R1(config-if)#ipv6 rip TEST enable 
R1(config-if)#int s1/0 
R1(config-if)#ipv6 rip TEST enable 

R2(config)#ipv6 unicast-routing 
R2(config)#ipv6 router rip R2 
R2(config-rtr)#int range f0/1 , f0/0 
R2(config-if-range)#ipv6 rip R2 enable 

R3(config)#ipv6 unicast-routing 
- RIPng 데이터베이스를 만들지 않고 인터페이스에 적용하면 데이터베이스가 생성된다. 
R3(config)#int f0/0 
R3(config-if)#ipv6 rip R3 enable 
R3(config-if)#int s1/0 
R3(config-if)#ipv6 rip R3 enable

R4(config)#ipv6 unicast-routing 
R4(config)#ipv6 router rip R4 
R4(config-rtr)#int lo0 
R4(config-if)#ipv6 rip R4 enable 
R4(config-if)#int f0/0 
R4(config-if)#ipv6 rip R4 enable

- RIPng 설정 삭제는 RIPng 데이터베이스를 삭제하면 된다. 
R1(config)#no ipv6 router rip TEST

R2(config)#no ipv6 router rip R2 
R3(config)#no ipv6 router rip R3 
R4(config)#no ipv6 router rip R4
```

### EIGRP for IPv6 설정

```
R1(config)#ipv6 unicast-routing 
R1(config)#ipv6 router eigrp 100 
R1(config-rtr)#router-id 1.1.1.1 
R1(config-rtr)#no shutdown 
R1(config-rtr)#int lo0 
R1(config-if)#ipv6 eigrp 100 
R1(config-if)#int f0/1 
R1(config-if)#ipv6 eigrp 100 
R1(config-if)#int s1/0 
R1(config-if)#ipv6 eigrp 100 

R2(config)#ipv6 unicast-routing 
R2(config)#ipv6 router eigrp 100 
R2(config-rtr)#router-id 2.2.2.2 
R2(config-rtr)#no shutdown 
R2(config-rtr)#int range f0/0 - 1 
R2(config-if-range)#ipv6 eigrp 100 

R3(config)#ipv6 unicast-routing 
R3(config)#ipv6 router eigrp 100 
R3(config-rtr)#router-id 3.3.3.3 
R3(config-rtr)#no shutdown  
R3(config-rtr)#int s1/0 
R3(config-if)#ipv6 eigrp 100 
R3(config-if)#int f0/0 
R3(config-if)#ipv6 eigrp 100 

R4(config)#ipv6 unicast-routing 
R4(config)#ipv6 router eigrp 100 
R4(config-rtr)#router-id 4.4.4.4 
R4(config-rtr)#no shutdown 
R4(config-rtr)#int lo0 
R4(config-if)#ipv6 eigrp 100 
R4(config-if)#int f0/0 
R4(config-if)#ipv6 eigrp 100

- EIGRP for IPv6 설정 삭제 (R1 ~ R4 명령 동일) 
R1(config)#no ipv6 router eigrp 100
```

### OSPFv3 설정

```
R1(config)#ipv6 unicast-routing 
R1(config)#ipv6 router ospf 1 
R1(config-rtr)#router-id 1.1.1.1 
R1(config-rtr)#int lo0 
R1(config-if)#ipv6 ospf 1 area 0 
R1(config-if)#int f0/1 
R1(config-if)#ipv6 ospf 1 area 0 
R1(config-if)#int s1/0 
R1(config-if)#ipv6 ospf 1 area 0 

R2(config)#ipv6 uni 
R2(config)#ipv6 router ospf 1 
R2(config-rtr)#router-id 2.2.2.2 
R2(config-rtr)#int range f0/0 - 1 
R2(config-if-range)#ipv6 ospf 1 area 0 

R3(config)#ipv6 uni 
R3(config)#ipv6 router ospf 1 
R3(config-rtr)#router-id 3.3.3.3 
R3(config-rtr)#int s1/0 
R3(config-if)#ipv6 ospf 1 area 0 
R3(config-if)#int f0/0 
R3(config-if)#ipv6 ospf 1 area 0 

R4(config)#ipv6 uni 
R4(config)#ipv6 router ospf 1 
R4(config-rtr)#router-id 4.4.4.4 
R4(config-rtr)#int lo0 
R4(config-if)#ipv6 ospf 1 area 0 
R4(config-if)#int f0/0 
R4(config-if)#ipv6 ospf 1 area 0
```

[재분배와 AD](https://www.notion.so/AD-a5f56fc3e8984fd1a81db097299dd034)

# IP Addressing 문제

1. IP Address 할당에 대한 설명으로 옳지 않은 것은?
    1. Class A는 최상위 3비트를 '110'으로 설정한다.
    2. Class B는 최상위 2비트를 '10'으로 설정한다.
    3. 모든 Host 비트가 '1'일 경우 브로드캐스트 주소로 인식되기 때문에 할당하여 사용하지 않는다.
    4. Network ID로 ‘127.x.x.x’는 할당하여 사용할 수 없다.
2. 네트워크 '210.182.73.0'을 서브넷팅한 후 각 서브넷은 적어도 40개 이상의 Host 주소가 필요하다. 적절한 서브넷 마스크 값은?
    1. 255.255.255.192
    2. 255.255.255.224
    3. 255.255.255.240
    4. 255.255.255.248
3. C Class에서 유효한 IP Address는?
    1. 33.114.17.24
    2. 128.46.83.25
    3. 202.67.13.87
    4. 222.248.256.34
4. 서브넷 마스크(Subnet Mask)에 대한 설명으로 옳지 않은 것은?
    1. A, B, C Class 대역의 IP Address는 모두 같은 서브넷 마스크를 사용한다.
    2. 하나의 주 네트워크를 여러 개의 네트워크로 분할하여 IP Address를 효율적으로 설계하여 사용할 수 있다.
    3. 네트워크 부분과 호스트 부분을 구분하는 기능을 갖는다.
    4. 네트워크 부분의 비트는 1이고, 호스트 부분의 비트는 0이다.
5. IPv4 Address 체계에서 가장 많은 네트워크를 가지는 Class로, 시작 옥텟의 비트가 '110'인 것은?

    가. A Class    나. B Class

    다. C Class    라. D Class

6. C Class의 네트워크를 호스트 수가 12개를 만족하도록 서브넷팅할 때 분할되는 서브넷 수는?

    가. 2    나. 4

    다. 8    라. 16

7. C Class의 네트워크를 서브넷팅하여 각 서브넷에 4~5 대의 PC를 연결해야 할 때, 서브넷 마스크 값으로 올바른 것은?
    1. 255.255.255.240
    2. 255.255.0.192
    3. 255.255.255.248
    4. 255.255.255.0
8. 호스트의 IP Address가 '200.221.100.152'일 때 해당하는 Class는?

    가. A Class    나. B Class

    다. C Class    라. D Class

9. IPv4 Class 중에서 멀티캐스트 용도로 사용되는 것은?

    가. A Class    나. B Class

    다. C Class    라. D Class

10. Broadcast 통신의 의미는?
    1. 메시지가 한 호스트에서 다른 호스트로 전송
    2. 메시지가 한 호스트에서 망상의 다른 한 호스트들로 전송
    3. 메시지가 한 호스트에서 망상의 다른 모든 호스트로 전송
    4. 메시지가 한 호스트에서 여러 호스트로 전송

# 라우팅 문제

1. 다음 중 EIGRP에 대한 내용으로 올바르지 않은 것은?
    1. Distance Vector Routing Protocol
    2. Link State Routing Protocol
    3. IP Protocol Number 88
    4. Unequal Cost Load Balancing
2. 다음 중 EIGRP 프로세스가 동작중인 라우터에 생성되는 DB목록의 이름으로 올바르지 않은 것은?
    1. Neighbor Table
    2. Topology Table
    3. Routing Table
    4. Database Table
3. 관리자가 아래의 네트워크 구성도처럼 EIGRP를 구성하였으나 두 라우터는 네이버를 맺지 못하는 문제가 발생하였다. 이유가 무엇인가?

    ![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/97086b43-891f-4b69-a97e-f92ca6b85f1b/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/97086b43-891f-4b69-a97e-f92ca6b85f1b/Untitled.png)

    1. 두 라우터의 EIGRP 광고방식이 잘못 되었다.
    2. 자동축약 기능이 서로 다르게 설정 되었다.
    3. AS 번호가 서로 다르다.
    4. EIGRP는 비연속 네트워크를 지원하지 못한다.
4. EIGRP에서 Router-ID 선출 기준이 가장 최우선하는 것은?
    1. EIGRP Router-ID 명령을 사용한 경우
    2. 루프백 IP 주소 중 가장 낮은 IP 주소
    3. 루프백 IP 주소 중 가장 높은 IP 주소
    4. 실제 설정 된 IP 주소 중 가장 높은 IP 주소
5. EIGRP의 AS번호에 대해 올바르게 설명한 것은?
    1. IANA에서 사용할 AS번호를 할당 받아 사용한다.
    2. 조직 내부의 모든 라우터가 반드시 일치할 필요는 없다.
    3. 1~65,535번까지의 정수에서 관리자가 임의로 사용한다.
    4. IP주소 포맷을 사용할 수도 있다.
6. 라우터에 EIGRP 설정한 후 아래처럼 EIGRP 동작 상태를 확인하는 명령은?

    ```
    Routing Protocol is "eigrp  1 "
    Outgoing update filter list for all interfaces is not set
    Incoming update filter list for all interfaces is not set
    Default networks flagged in outgoing updates
    Default networks accepted from incoming updates
    EIGRP metric weight K1=1, K2=0, K3=1, K4=0, K5=0
    EIGRP maximum hopcount 100
    EIGRP maximum metric variance 1
    ```

    1. show ip protocols
    2. show ip eigrp neighbors
    3. show ip eigrp topology
    4. show ip route
7. EIGRP 패킷 중 네이버를 구성하고 유지하기 위해 사용되는 패킷과 목적지 IP 주소가 맞게 연결된 것은?
    1. hello packet – 224.0.0.5
    2. hello packet – 224.0.0.10
    3. update packet – 224.0.0.9
    4. update packet – next hop ip address
8. Ethernet으로 연결된 라우터에 EIGRP를 설정한 후 기본 Hello Time 및 Hold Time은 몇 초인가?
    1. Hello=5초, Hold=15초
    2. Hello=5초, Hold=20초
    3. Hello=30초, Hold=90초
    4. Hello=60초, Hold=180초
9. 다음은 EIGRP가 설정된 네트워크 구성도이다. R2에서 목적지 A NETWROK의 Metric은 얼마인가?

    ![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/16c7a5e9-8236-4761-891d-f9b117be0c12/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/16c7a5e9-8236-4761-891d-f9b117be0c12/Untitled.png)

    1. 120
    2. 30720
    3. 76800
    4. 261120
10. 관리자는 회사 내부 라우터들에 RIPv2, EIGRP, OSPF를 모두 중복 구성하였다. 라우팅 테이블에 최종적으로 보여지는 정보에 대하여 올바르게 설명한 것은?
    1. 하나의 라우터에 다수의 라우팅 프로세스를 설정할 수 없다.
    2. 최초에 설정한 라우팅 프로토콜이 활성화되어 라우팅 테이블을 만들게 된다.
    3. Distance Vector Protocol보다 Link Stat Protocol이 우선하므로 OSPF 정보가 세팅될 것이다.
    4. EIGRP의 AD가 90으로 가장 낮으므로 EIGRP 정보가 세팅될 것이다.
11. EIGRP로 구성된 네트워크 환경에서 기존의 Metric보다 높은 Metric을 Successor로부터 수신했고 Feasible Successor가 존재하지 않을 때 EIGRP Dual의 동작에 대해 올바른 것은?
    1. 다른 네이버에게 Query를 송신한다.
    2. 네이버 리스트에서 임의의 라우터를 Successor로 우선 설정한다.
    3. 아무것도 하지 않는다.
    4. 기존 Metric의 변경을 다른 네이버에게 Update 한다.
12. 다음 중 OSPF에 대한 설명으로 올바르지 않은 것은?
    1. Distance Vector Routing Protocol
    2. Link State Routing Protocol
    3. IP Protocol Number 89
    4. interior gateway protocol
13. 다음 중 OSPF Packet이 아닌 것은?
    1. Hello Packet
    2. Database Description Packet
    3. Link State Request Packet
    4. Query Packet
14. OSPF Hello Packet의 구성요소 중 라우터 간에 일치하지 않아도 네이버를 맺는데 문제 되는 않는 것은?
    1. Area ID
    2. Neighbor List
    3. Hello Interval
    4. Authentication Password
15. OSPF에서 LSA(광고정보)를 포함하는 패킷의 이름은?
    1. Database Description
    2. Link State Request
    3. Link State Update
    4. Link State Ack
16. OSPF 네이버 간에 Adjacency 관계가 되지 못하는 관계는?
    1. DR과 다른 라우터
    2. Point-to-Point 네트워크로 연결된 라우터
    3. Virtual Link로 연결된 라우터
    4. DRother와 DRother

# 스위치 문제

1. 다음 중 스위치의 모양에 따른 분류라고 보기 힘든 것은?

    가. 독립형 스위치 나. 스택형 스위치

    다. 모듈형 스위치 라. 더미형 스위치

2. 다음 중 허브의 기능에 대해 잘 못 설명한 것은?
    1. 전기적 신호를 증폭한다.
    2. 다중 접속 환경을 제공한다.
    3. MAC 주소 테이블 기반하여 포워딩한다.
    4. 수신포트 제외한 모든 포트로 플러딩한다.
3. 다음 중 트랜스패런트 브리징에 대한 설명이 잘 못 된 것은?
    1. 프레임이 특정포트에 들어올 때 목적지 MAC 주소를 학습하는 기능을 러닝이라고 한다.
    2. 목적지 MAC 주소가 MAC 테이블에 없을 때 전체 포트에 복사하여 전송하는 것을 플러딩이라고 한다.
    3. 시스코 스위치는 기본적으로 MAC 주소를 학습한 후 에이징 타임에 의해 5분 뒤 삭제된다.
    4. MAC 테이블에 출발지와 목적지 MAC 주소가 동일한 포트일 경우 해당 프레임은 필터링에 의해 차단된다.
4. 스위치 포트에서 VLAN 트렁크로 사용할 수 있는 모드가 아닌 것은?

    가. auto        나. on

    다. desirable 라. Forwarding

5. 다음 중 802.1Q 트렁크에 대해 잘못 설명한 것은?
    1. Native VLAN 프레임은 태깅을 하지 않는다.
    2. Native VLAN 설정은 양쪽 스위치에 같아야 한다.
    3. 비표준 프로토콜이다.
    4. 확장 VLAN을 지원한다.
6. 다음 중 트렁크 포트를 확인하는 명령은?
    1. show ip interface brief
    2. show interface trunk
    3. show switchport trunk
    4. show spanning-tree vlan
7. 다음 중 VLAN을 사용하는 이유가 아닌 것은?
    1. 대규모 네트워크에서 IP 주소 절약방법이다.
    2. 브로드캐스트 도메인의 사이즈를 줄인다.
    3. 논리적으로 부서별 네트워크 보안을 강화한다.
    4. 네트워크를 물리적이 아닌 논리적으로 분할함으로써 비용을 절감한다.
8. 다음 중 이더넷(Ethernet)에서 사용하는 VLAN 번호가 아닌 것은?

    가. 1       나. 1001

    다. 1002 라. 1006

9. 스위치에 설정된 VLAN과 이름을 다른 스위치에 광고하는 프로토콜은?

    가. ISL   나. DTP

    다. VTP 라. Dot1q

10. 다음 중 이더넷 프레임 루프가 발생할 때 나타나는 현상과 거리가 먼 것은?
    1. 브로드캐스트 스톰이 발생하여 스위치 전체를 빠르게 동작시킨다.
    2. 동일한 출발지 MAC 주소를 가진 프레임이 서로 다른 인터페이스로 수신되어 MAC 테이블 불안정 현상이 일어난다.
    3. 목적지 호스트가 동일 프레임을 여러 번 수신 받게 되어 애플리케이션이 제대로 동작하지 않는다.
    4. STP는 스위치에서 이더넷 프레임 루프를 방지하는 프로토콜이다.
11. 다음 스위치 네트워크에는 STP가 동작 중이다. STP 지정포트(Designated Port)를 모두 표시하시오.

![https://s3-us-west-2.amazonaws.com/secure.notion-static.com/00f418d5-1ac4-4b28-9cf8-f46b1358bdd0/Untitled.png](https://s3-us-west-2.amazonaws.com/secure.notion-static.com/00f418d5-1ac4-4b28-9cf8-f46b1358bdd0/Untitled.png)
